
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Gitee 分析 · 2019 中国开源年度报告</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="开源社">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="insight.html" />
    
    
    <link rel="prev" href="data-grank.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="perface.html">
            
                <a href="perface.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="investigation.html">
            
                <a href="investigation.html">
            
                    
                    问卷篇
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    数据篇
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="data-grank.html">
            
                <a href="data-grank.html">
            
                    
                    Grank 分析
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4.2" data-path="data-gitee.html">
            
                <a href="data-gitee.html">
            
                    
                    Gitee 分析
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="insight.html">
            
                <a href="insight.html">
            
                    
                    洞察篇
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="conclusion.html">
            
                <a href="conclusion.html">
            
                    
                    结语
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="thankyou.html">
            
                <a href="thankyou.html">
            
                    
                    感谢
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >Gitee 分析</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="gitee-&#x5206;&#x6790;">Gitee &#x5206;&#x6790;</h1>
<p>Gitee.com &#x662F;&#x5F00;&#x6E90;&#x4E2D;&#x56FD;&#x65D7;&#x4E0B;&#x7684;&#x4EE3;&#x7801;&#x6258;&#x7BA1;&#x5E73;&#x53F0;&#xFF0C;&#x81EA; 2013 &#x5E74;&#x63A8;&#x51FA;&#x81F3;&#x4ECA;&#xFF0C;&#x5DF2;&#x6709;&#x8D85;&#x8FC7; 400 &#x4E07;&#x5F00;&#x53D1;&#x8005;&#x7528;&#x6237;&#x3002;&#x6211;&#x4EEC;&#x5BF9;&#x6258;&#x7BA1;&#x5728; Gitee &#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x8FDB;&#x884C;&#x4E86;&#x7EDF;&#x8BA1;&#x5206;&#x6790;&#xFF0C;&#x68B3;&#x7406;&#x548C;&#x89E3;&#x8BFB;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3001;&#x529F;&#x80FD;&#x5206;&#x5E03;&#x7684;&#x53D8;&#x5316;&#x8D8B;&#x52BF;&#xFF0C;&#x5206;&#x6790;&#x5F00;&#x53D1;&#x8005;&#x5728; Gitee &#x53C2;&#x4E0E;&#x5F00;&#x6E90;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4EE5;&#x671F;&#x4E3A;&#x89C2;&#x5BDF;&#x56FD;&#x5185;&#x5F00;&#x6E90;&#x7684;&#x6F14;&#x8FDB;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x201C;&#x672C;&#x571F;&#x5E73;&#x53F0;&#x201D;&#x89C6;&#x89D2;&#x3002;</p>
<h2 id="&#x4E00;&#x3001;&#x8D8B;&#x52BF;&#x4E0E;&#x5206;&#x5E03;">&#x4E00;&#x3001;&#x8D8B;&#x52BF;&#x4E0E;&#x5206;&#x5E03;</h2>
<h3 id="11-&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x8D8B;&#x52BF;">1.1 &#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x8D8B;&#x52BF;</h3>
<p><strong>2019 Gitee &#x6700;&#x53D7;&#x6B22;&#x8FCE;&#x7F16;&#x7A0B;&#x8BED;&#x8A00; TOP 10</strong></p>
<p><img src="images/3-gitee-1.jpg" alt=""></p>
<ul>
<li><p>Java &#x548C; JavaScript &#x5360;&#x636E;&#x524D;&#x4E24;&#x4F4D;&#xFF0C;&#x4E0E;&#x53BB;&#x5E74;&#x6392;&#x540D;&#x4E00;&#x81F4;&#xFF0C;&#x4F46; Java &#x5F00;&#x6E90;&#x9879;&#x76EE;&#x5360;&#x6BD4;&#x5C0F;&#x5E45;&#x4E0B;&#x964D;&#xFF0C;&#x800C; JavaScript &#x5F00;&#x6E90;&#x9879;&#x76EE;&#x5360;&#x6BD4;&#x6709;&#x5C0F;&#x5E45;&#x4E0A;&#x5347;&#x3002; &#x7ED3;&#x5408;&#x4E0B;&#x8DCC; 4 &#x4F4D;&#x3001;&#x6392;&#x5728;&#x7B2C; 10 &#x7684; Android &#x6765;&#x770B;&#xFF08;Android &#x4E25;&#x683C;&#x800C;&#x8A00;&#x4E0D;&#x662F;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x672C;&#x8D28;&#x4E0A;&#x53CD;&#x6620;&#x7684;&#x4E3B;&#x8981;&#x662F; Java &#x4E0E; Kotlin &#x8BED;&#x8A00;&#xFF09;&#xFF0C;Java &#x5360;&#x6BD4;&#x5C0F;&#x5E45;&#x4E0B;&#x964D;&#x53EF;&#x80FD;&#x4E0E;&#x8C37;&#x6B4C;&#x4ECA;&#x5E74;&#x7684; Kotlin First &#x6218;&#x7565;&#x6709;&#x5173;&#xFF0C;&#x73B0;&#x5728;&#xFF0C;&#x5982;&#x679C;&#x5F00;&#x53D1; Android &#x5E94;&#x7528;&#xFF0C;Kotlin &#x6210;&#x4E3A;&#x4E86;&#x4E0E; Java &#x4E00;&#x6837;&#x7684;&#x4E00;&#x7EA7;&#x8BED;&#x8A00;&#xFF0C;&#x8FD9;&#x6216;&#x8BB8;&#x5206;&#x6D41;&#x4E86;&#x4E00;&#x90E8;&#x5206; Java &#x5F00;&#x53D1;&#x8005;&#x3002;</p>
</li>
<li><p>Android &#x7684;&#x6574;&#x4F53;&#x4E0B;&#x8DCC;&#x53EF;&#x80FD;&#x4E0E; Kotlin &#x521A;&#x521A;&#x5927;&#x89C4;&#x6A21;&#x8FDB;&#x5165; Android &#x5F00;&#x53D1;&#x8005;&#x89C6;&#x91CE;&#x6709;&#x5173;&#xFF0C;&#x6BD5;&#x7ADF;&#x9879;&#x76EE;&#x4ECE; Java &#x8FC1;&#x79FB;&#x5230; Kotlin&#xFF0C;&#x6216;&#x8005;&#x5F00;&#x53D1;&#x8005;&#x4ECE; Java &#x5207;&#x6362;&#x5230; Kotlin &#x6765;&#x5F00;&#x53D1;&#x65B0;&#x9879;&#x76EE;&#x90FD;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x6210;&#x672C;&#x3002;&#x4F46;&#x66F4;&#x4E3B;&#x8981;&#x662F;&#x53D7;&#x5230;&#x4E86;&#x8FD1;&#x4E24;&#x5E74;&#x7206;&#x53D1;&#x7684;&#x5927;&#x524D;&#x7AEF;&#x8D8B;&#x52BF;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x5FAE;&#x4FE1;&#x5C0F;&#x7A0B;&#x5E8F;&#x3001;&#x767E;&#x5EA6;&#x667A;&#x80FD;&#x5C0F;&#x7A0B;&#x5E8F;&#x3001;&#x963F;&#x91CC;&#x5C0F;&#x7A0B;&#x5E8F;&#xFF08;&#x652F;&#x4ED8;&#x5B9D;&#x3001;&#x9489;&#x9489;&#x7B49;&#xFF09;&#x3001;&#x5FEB;&#x5E94;&#x7528;&#x3001;&#x6DF7;&#x5408;&#x3001;PWA &#x4E0E; WebAssembly &#x7B49;&#x5404;&#x79CD;&#x5927;&#x524D;&#x7AEF;&#x6280;&#x672F;&#x5728; 2019 &#x5E74;&#x4E89;&#x76F8;&#x8FDB;&#x5165;&#x843D;&#x5730;&#x671F;&#xFF0C;&#x50AC;&#x751F;&#x51FA;&#x5404;&#x79CD;&#x8DE8;&#x7AEF;&#x65B9;&#x6848;&#xFF0C;&#x4F7F;&#x5F97;&#x5927;&#x524D;&#x7AEF;&#x70ED;&#x95F9;&#x5F02;&#x5E38;&#x3002;&#x805A;&#x7126;&#x5230;&#x79FB;&#x52A8;&#x5F00;&#x53D1;&#xFF0C;&#x7531;&#x4E8E;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x89E3;&#x653E;&#x4E86;&#x5BF9;&#x5E95;&#x5C42;&#x5E73;&#x53F0;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x79FB;&#x52A8;&#x5F00;&#x53D1;&#x4E0D;&#x518D;&#x5C40;&#x9650;&#x4E8E; Android &#x4E0E; iOS &#x8FD9;&#x6837;&#x7684;&#x7279;&#x5B9A;&#x7AEF;&#xFF0C;&#x8BB8;&#x591A;&#x5F00;&#x53D1;&#x8005;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x5F00;&#x53D1;&#x201C;&#x79FB;&#x52A8; app&#x201D;&#xFF0C;&#x76F4;&#x63A5;&#x7528;&#x8DE8;&#x7AEF;&#x6846;&#x67B6;&#x5F00;&#x53D1;&#x201C;&#x5C0F;&#x7A0B;&#x5E8F;&#x201D;&#x4E0D;&#x4EC5;&#x66F4;&#x52A0;&#x4FBF;&#x6377;&#xFF0C;&#x5BF9;&#x4F01;&#x4E1A;&#x800C;&#x8A00;&#x4E5F;&#x662F;&#x80FD;&#x591F;&#x5927;&#x5E45;&#x964D;&#x4F4E;&#x7814;&#x53D1;&#x548C;&#x8FD0;&#x7EF4;&#x6210;&#x672C;&#x7684;&#x6027;&#x4EF7;&#x6BD4;&#x4E4B;&#x9009;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x7ECF;&#x6D4E;&#x5F62;&#x52BF;&#x653E;&#x7F13;&#x3001;&#x4E92;&#x8054;&#x7F51;&#x5BD2;&#x51AC;&#x4E5F;&#x662F; Android &#x5F00;&#x53D1;&#x7684;&#x201C;&#x5F0F;&#x5FAE;&#x201D;&#x7684;&#x4E00;&#x4E2A;&#x80CC;&#x666F;&#x539F;&#x56E0;&#x3002;</p>
</li>
<li><p>Python &#x4ECA;&#x5E74;&#x4E0A;&#x5347;&#x4E00;&#x4F4D;&#xFF0C;&#x9996;&#x6B21;&#x8FDB;&#x5165;&#x524D;&#x4E09;&#xFF0C;&#x53CD;&#x6620;&#x51FA;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x6301;&#x7EED;&#x5347;&#x6E29;&#xFF0C;&#x5728; 2019 &#x83B7;&#x5F97;&#x66F4;&#x591A;&#x7A0B;&#x5E8F;&#x5458;&#x8BA4;&#x53EF;&#x3002;C++ &#x5360;&#x6BD4;&#x4E0A;&#x5347;&#x4E24;&#x4F4D;&#xFF0C;&#x867D;&#x7136; Rust &#x4ECA;&#x5E74;&#x5927;&#x706B;&#xFF0C;&#x4F46;&#x5F53;&#x524D;&#x5E95;&#x5C42;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x6027;&#x8D28;&#x7684;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x533A;&#x5757;&#x94FE;&#x3001;&#x6BD4;&#x7279;&#x5E01;&#x7B49;&#x65B0;&#x5174;&#x57FA;&#x7840;&#x9879;&#x76EE;&#x4E3B;&#x8981;&#x8FD8;&#x662F;&#x4F7F;&#x7528; C/C++&#x3002;</p>
</li>
<li><p>Golang &#x9996;&#x6B21;&#x8FDB;&#x5165;&#x524D;&#x5341;&#xFF0C;&#x8FD9;&#x4E0E;&#x8FD1;&#x5E74;&#x6765;&#x4E91;&#x539F;&#x751F;&#x3001;&#x5BB9;&#x5668;&#x5316;&#x706B;&#x7206;&#x4E0D;&#x65E0;&#x5173;&#x7CFB;&#x3002;</p>
</li>
</ul>
<p><strong>2019 Gitee &#x589E;&#x901F;&#x6700;&#x5FEB;&#x7F16;&#x7A0B;&#x8BED;&#x8A00; TOP 10</strong></p>
<p><img src="images/3-gitee-2.jpg" alt=""></p>
<ul>
<li><p>&#x968F;&#x7740; Google &#x7684; Flutter &#x6846;&#x67B6;&#x7684;&#x706B;&#x70ED;&#xFF0C;Dart &#x8BED;&#x8A00;&#x53D7;&#x5230;&#x5E7F;&#x6CDB;&#x5173;&#x6CE8;&#x548C;&#x4F7F;&#x7528;&#xFF0C;&#x589E;&#x901F;&#x8D85;&#x8FC7; 250%&#x3002;&#x4ECA;&#x5E74; Flutter &#x53D1;&#x5E03;&#x4E86;&#x8FC4;&#x4ECA;&#x4E3A;&#x6B62;&#x6700;&#x91CD;&#x5927;&#x7684;&#x7248;&#x672C;&#xFF0C;&#x4E00;&#x4E3E;&#x6210;&#x4E3A;&#x591A;&#x5E73;&#x53F0;&#x6846;&#x67B6;&#xFF0C;&#x652F;&#x6301;&#x79FB;&#x52A8;&#x3001;Web&#x3001;&#x684C;&#x9762;&#x4E0E;&#x5D4C;&#x5165;&#x5F0F;&#x8BBE;&#x5907;&#xFF1B;&#x800C; Dart &#x4E5F;&#x5728;&#x4E0E; C &#x7684;&#x4E92;&#x64CD;&#x4F5C;&#x3001;UI &#x6784;&#x5EFA;&#x548C;&#x9884;&#x7F16;&#x8BD1;&#x672C;&#x5730;&#x53EF;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x7B49;&#x7279;&#x6027;&#x4E0A;&#x5927;&#x5E45;&#x6539;&#x8FDB;&#x3002;</p>
</li>
<li><p>&#x6CE8;&#x91CD;&#x9AD8;&#x6548;&#x3001;&#x5B89;&#x5168;&#x4E0E;&#x5E76;&#x884C;&#x7684;&#x7CFB;&#x7EDF;&#x7EA7;&#x7F16;&#x7A0B;&#x8BED;&#x8A00; Rust &#x53D7;&#x5230;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x5F00;&#x53D1;&#x8005;&#x7684;&#x5173;&#x6CE8;&#x548C;&#x4F7F;&#x7528;&#x3002;&#x503C;&#x5F97;&#x4E00;&#x63D0;&#x7684;&#x662F;&#xFF0C;&#x56FD;&#x5185;&#x76EE;&#x524D;&#x5E76;&#x6CA1;&#x6709;&#x592A;&#x591A;&#x7279;&#x522B;&#x4F18;&#x79C0;&#x7684; Rust &#x843D;&#x5730;&#x5B9E;&#x8DF5;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x4E0E; Rust &#x8BED;&#x6CD5;&#x6666;&#x6DA9;&#x96BE;&#x61C2;&#x3001;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#x8FC7;&#x4E8E;&#x9661;&#x5CED;&#x6709;&#x5173;&#x3002;&#x4F46; Rust &#x662F;&#x4E00;&#x95E8;&#x6781;&#x5177;&#x6F5C;&#x529B;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x5E76;&#x4E14;&#x83B7;&#x5F97;&#x4E86;&#x5FAE;&#x8F6F;&#x3001;&#x8C37;&#x6B4C;&#x7B49;&#x5927;&#x5382;&#x7684;&#x5927;&#x529B;&#x652F;&#x6301;&#xFF0C;&#x672A;&#x6765;&#x53EF;&#x671F;&#x3002;&#x5DF2;&#x6709; Rust &#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x6210;&#x957F;&#x540C;&#x6837;&#x503C;&#x5F97;&#x671F;&#x5F85;&#xFF0C;&#x6BD4;&#x5982;&#x5185;&#x5D4C;&#x5F0F; Docker &#x2014;&#x2014;Rocker&#xFF0C;&#x9488;&#x5BF9;&#x57FA;&#x4E8E; Linux &#x7684;&#x8D44;&#x6E90;&#x53D7;&#x9650;&#x7684; IoT &#x7CFB;&#x7EDF;&#xFF0C;&#x65E8;&#x5728;&#x63D0;&#x9AD8;&#x5176;&#x8D44;&#x6E90;&#x5229;&#x7528;&#x7387;&#x548C;&#x7CFB;&#x7EDF;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x907F;&#x514D;&#x989D;&#x5916;&#x7684;&#x6027;&#x80FD;&#x5F00;&#x9500;&#x3002;</p>
</li>
<li><p>MATLAB &#x5DF2;&#x8FDE;&#x7EED;&#x4E24;&#x5E74;&#x4EE5;&#x8D85;&#x8FC7; 130% &#x7684;&#x901F;&#x5EA6;&#x589E;&#x957F;&#xFF0C;MATLAB &#x5E94;&#x7528;&#x8303;&#x56F4;&#x975E;&#x5E38;&#x5E7F;&#xFF0C;&#x5305;&#x62EC;&#x4FE1;&#x53F7;&#x548C;&#x56FE;&#x50CF;&#x5904;&#x7406;&#x3001;&#x901A;&#x8BAF;&#x3001;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x3001;&#x6D4B;&#x8BD5;&#x548C;&#x6D4B;&#x91CF;&#x3001;&#x8D22;&#x52A1;&#x5EFA;&#x6A21;&#x548C;&#x5206;&#x6790;&#x4EE5;&#x53CA;&#x8BA1;&#x7B97;&#x751F;&#x7269;&#x5B66;&#x7B49;&#x4F17;&#x591A;&#x5E94;&#x7528;&#x9886;&#x57DF;&#x3002;</p>
</li>
<li><p>TypeScript &#x7A33;&#x624E;&#x7A33;&#x6253;&#xFF0C;&#x76EE;&#x524D;&#x662F; JavaScript &#x4E2D;&#x6700;&#x53D7;&#x6B22;&#x8FCE;&#x7684;&#x65B9;&#x8A00;&#xFF0C;&#x8FD9;&#x4E0E;&#x51E0;&#x5927; TS &#x7F16;&#x5199;&#x7684;&#x524D;&#x7AEF;&#x6846;&#x67B6;&#x5728;&#x5927;&#x524D;&#x7AEF;&#x9886;&#x57DF;&#x7684;&#x81EA;&#x7531;&#x53D1;&#x6325;&#x6709;&#x6781;&#x5927;&#x5173;&#x7CFB;&#x3002;</p>
</li>
<li><p>Kotlin &#x7684;&#x589E;&#x957F;&#x4F3C;&#x4E4E;&#x4E0D;&#x592A;&#x7406;&#x60F3;&#xFF0C;&#x4E0D;&#x8FC7;&#x5982;&#x524D;&#x6587;&#x6240;&#x8FF0;&#xFF0C;Kotlin &#x521A;&#x521A;&#x5927;&#x89C4;&#x6A21;&#x8FDB;&#x5165;&#x5F00;&#x53D1;&#x8005;&#x89C6;&#x91CE;&#xFF0C;&#x5F00;&#x53D1;&#x8005;&#x5728;&#x8FC1;&#x79FB;&#x65F6;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x6210;&#x672C;&#xFF0C;&#x5E76;&#x4E14;&#x957F;&#x671F;&#x4EE5;&#x6765;&#xFF0C;Java &#x4EE5;&#x5176;&#x5B9E;&#x7528;&#x6027;&#x4E0E;&#x4E30;&#x5BCC;&#x7684;&#x751F;&#x6001;&#x7EDF;&#x6CBB;&#x7740; Android &#x5F00;&#x53D1;&#x9886;&#x57DF;&#xFF0C;&#x6216;&#x8BB8;&#x8FD8;&#x6CA1;&#x5230;&#x9000;&#x4F4D;&#x7684;&#x65F6;&#x5019;&#x3002;</p>
</li>
</ul>
<p><strong>2019 &#x6709;&#x66F4;&#x591A;&#x65B0;&#x8BED;&#x8A00;&#x51FA;&#x73B0;&#x5728; Gitee</strong></p>
<p><img src="images/3-gitee-3.jpg" alt=""></p>
<p>2019 &#x5E74;&#x6709;&#x8BB8;&#x591A;&#x7279;&#x522B;&#x5C0F;&#x4F17;&#x7684;&#x8BED;&#x8A00;&#x51FA;&#x73B0;&#x5728; Gitee &#x4E0A;&#xFF0C;&#x9664;&#x4E86;&#x5C0F;&#x4F17;&#xFF0C;&#x8FD9;&#x4E9B;&#x8BED;&#x8A00;&#x7684;&#x7279;&#x70B9;&#x662F;&#x7279;&#x522B;&#x201C;&#x6781;&#x5BA2;&#x201D;&#xFF0C;&#x90FD;&#x6709;&#x5F88;&#x5F3A;&#x70C8;&#x7684;&#x7279;&#x8272;&#x3002;&#x9664;&#x4E86;&#x5E7F;&#x53D7;&#x6B22;&#x8FCE;&#x7684;&#x660E;&#x661F;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x975E;&#x5E38;&#x6B23;&#x559C;&#x5730;&#x770B;&#x5230;&#x4E00;&#x4E9B;&#x76F8;&#x5BF9;&#x5C0F;&#x4F17;&#x3001;&#x6781;&#x5BA2;&#x5F0F;&#x7684;&#x3001;&#x5177;&#x6709;&#x65E0;&#x9650;&#x6F5C;&#x529B;&#x7684;&#x9879;&#x76EE;&#x548C;&#x65B0;&#x5C1D;&#x8BD5;&#x6D8C;&#x73B0;&#x3002;</p>
<h3 id="12--&#x529F;&#x80FD;&#x5206;&#x5E03;">1.2  &#x529F;&#x80FD;&#x5206;&#x5E03;</h3>
<p><strong>2019 Gitee &#x65B0;&#x589E;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x529F;&#x80FD;&#x5206;&#x5E03; TOP 10</strong>
<img src="images/3-gitee-4.jpg" alt=""></p>
<ul>
<li><p>&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x548C; WEB &#x5E94;&#x7528;&#x5F00;&#x53D1;&#x5360;&#x636E;&#x524D;&#x4E24;&#x4F4D;&#xFF0C;&#x4E0E; 2018 &#x5E74;&#x6392;&#x540D;&#x4E00;&#x81F4;&#xFF0C;&#x4F46;&#x5360;&#x6BD4;&#x90FD;&#x6709;&#x6240;&#x4E0B;&#x964D;&#xFF0C;&#x53EF;&#x80FD;&#x7684;&#x539F;&#x56E0;&#x662F;&#x5F00;&#x53D1;&#x8005;&#x5728;&#x66F4;&#x591A;&#x5C1D;&#x8BD5;&#x65B0;&#x7684;&#x529F;&#x80FD;&#x548C;&#x65B0;&#x7684;&#x65B9;&#x5411;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x8FD9;&#x4E00;&#x529F;&#x80FD;&#x5206;&#x7C7B;&#x9996;&#x6B21;&#x8FDB;&#x5165;&#x524D;&#x5341;&#xFF0C;&#x4E0E;&#x53BB;&#x5E74;&#x76F8;&#x6BD4;&#x589E;&#x957F;&#x4E86; 60%&#x3002;&#x5173;&#x4E8E; 2019 &#x5E74;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x7684;&#x6301;&#x7EED;&#x5347;&#x6E29;&#xFF0C;&#x4E0D;&#x5F97;&#x4E0D;&#x63D0;&#x5230; 2019 &#x5E74; TensorFlow &#x4E0E; PyTorch &#x7684;&#x6F14;&#x8FDB;&#xFF0C;TensorFlow &#x53D1;&#x5E03;&#x4E86; 2.0&#xFF0C;PyTorch &#x53D1;&#x5E03;&#x4E86; 1.0&#xFF0C;&#x5404;&#x81EA;&#x90FD;&#x5E26;&#x6765;&#x4E86;&#x6781;&#x5176;&#x5F3A;&#x5927;&#x7684;&#x65B0;&#x7279;&#x6027;&#xFF0C;&#x540C;&#x65F6;&#xFF0C;&#x57FA;&#x4E8E;&#x8FD9;&#x4E24;&#x5927;&#x6846;&#x67B6;&#xFF0C;&#x5404;&#x5927;&#x5382;&#x5546;&#x4E5F;&#x76F8;&#x7EE7;&#x5F00;&#x6E90;&#x4E86;&#x5404;&#x81EA;&#x7684;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x65B9;&#x6848;&#x3002;</p>
</li>
<li><p>&#x5FAE;&#x4FE1;&#x5F00;&#x53D1;&#x8DCC;&#x51FA;&#x524D;&#x5341;&#x3002;</p>
</li>
<li><p>&#x5176;&#x4ED6;&#x5F00;&#x6E90;&#x7C7B;&#x9879;&#x76EE;&#x540C;&#x6BD4;&#x589E;&#x957F; 52.11%&#xFF0C;&#x5176;&#x4E2D;&#x589E;&#x901F;&#x6700;&#x5FEB;&#x7684;&#x4E09;&#x4E2A;&#x5B50;&#x7C7B;&#x522B;&#x662F;&#x786C;&#x4EF6;&#x76F8;&#x5173;&#x9879;&#x76EE;&#x3001;&#x7269;&#x8054;&#x7F51;/&#x8FB9;&#x7F18;&#x8BA1;&#x7B97;&#x3001;&#x56FE;&#x4E66;/&#x624B;&#x518C;/&#x6559;&#x7A0B;&#x3002;&#x4E2D;&#x56FD;&#x81EA;&#x4E3B;&#x7814;&#x53D1;&#x7684;&#x7269;&#x8054;&#x7F51;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF; RT-Thread &#x6210;&#x529F;&#x83B7;&#x5F97;&#x6570;&#x767E;&#x4E07;&#x7F8E;&#x91D1;&#x7684;A&#x8F6E;&#x6295;&#x8D44;&#xFF0C;Raspberry Pi &#xFF08;&#x6811;&#x8393;&#x6D3E;&#xFF09;&#x53D1;&#x5E03; 4.0 &#x7248;&#x672C;&#xFF0C;&#x4E5F;&#x8BA9;&#x7269;&#x8054;&#x7F51;&#x3001;&#x786C;&#x4EF6;&#x9879;&#x76EE;&#x6301;&#x7EED;&#x53D7;&#x5230;&#x5F00;&#x53D1;&#x8005;&#x5173;&#x6CE8;&#x3002;</p>
</li>
</ul>
<p><strong>2019 Gitee &#x65B0;&#x589E;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x4E8C;&#x7EA7;&#x529F;&#x80FD;&#x5206;&#x5E03; TOP 10</strong></p>
<p><img src="images/3-gitee-5.jpg" alt=""></p>
<p>&#x786C;&#x4EF6;&#x76F8;&#x5173;&#x9879;&#x76EE;&#x53CA; Vue &#x6269;&#x5C55;&#x7EC4;&#x4EF6;&#x9996;&#x6B21;&#x8FDB;&#x5165;&#x524D;&#x5341;&#xFF0C;&#x4E14;&#x6392;&#x540D;&#x4E0A;&#x5347;&#x5E45;&#x5EA6;&#x8F83;&#x5927;&#x3002;&#x786C;&#x4EF6;&#x76F8;&#x5173;&#x9879;&#x76EE;&#x4E0E; 2018 &#x5E74;&#x540C;&#x6BD4;&#x589E;&#x957F; 139.29%&#xFF0C;Vue &#x6269;&#x5C55;&#x7EC4;&#x4EF6;&#x4E0E; 2018 &#x5E74;&#x540C;&#x6BD4;&#x589E;&#x957F; 44.74%&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3001;&#x529F;&#x80FD;&#x4E0E;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x76F8;&#x5173;&#x7684;&#x6570;&#x636E;&#x699C;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;Gitee &#x5E73;&#x53F0;&#x4E0A;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x4E0E;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x8D8B;&#x52BF;&#x4E5F;&#x6298;&#x5C04;&#x51FA;&#x56FD;&#x5185;&#x5F53;&#x524D;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x884C;&#x4E1A;&#x7684;&#x5927;&#x8D8B;&#x52BF;&#x3002;</p>
<h3 id="13--&#x6350;&#x8D60;&#x5206;&#x5E03;">1.3  &#x6350;&#x8D60;&#x5206;&#x5E03;</h3>
<p><strong>&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x5728; 2019 &#x6536;&#x83B7;&#x6350;&#x8D60;&#x6700;&#x591A;</strong></p>
<p><img src="images/3-gitee-6.jpg" alt=""></p>
<p>&#x5176;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E8C;&#x7EA7;&#x529F;&#x80FD;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x6700;&#x53D7;&#x6B22;&#x8FCE;&#xFF1A;</p>
<p><img src="images/3-gitee-7.jpg" alt=""></p>
<p>&#x540E;&#x53F0;&#x7BA1;&#x7406;&#x6846;&#x67B6;&#x7684;&#x6350;&#x8D60;&#x8005;&#x4EBA;&#x6570;&#x5360;&#x6BD4;&#x8D85;&#x8FC7;&#x4E86;&#x56DB;&#x5206;&#x4E4B;&#x4E00;&#xFF0C;&#x6350;&#x8D60;&#x8005;&#x5360;&#x6BD4;&#x6700;&#x591A;&#x7684;&#x9879;&#x76EE;&#x7684;&#x4E00;&#x5927;&#x5171;&#x540C;&#x7279;&#x70B9;&#x662F;&#xFF1A;&#x5E94;&#x7528;&#x6027;&#x5F3A;&#x3001;&#x5F00;&#x7BB1;&#x5373;&#x7528;&#x3002;</p>
<h3 id="14--&#x5F00;&#x53D1;&#x8005;&#x5730;&#x57DF;&#x5206;&#x5E03;">1.4  &#x5F00;&#x53D1;&#x8005;&#x5730;&#x57DF;&#x5206;&#x5E03;</h3>
<p><img src="images/3-gitee-8.jpg" alt=""></p>
<p>&#x4F7F;&#x7528; Gitee &#x7684;&#x5F00;&#x53D1;&#x8005;&#x5206;&#x5E03;&#x6392;&#x540D;&#x524D;&#x4E09;&#x4F4D;&#x662F;&#xFF1A;&#x5E7F;&#x4E1C;&#x3001;&#x5317;&#x4EAC;&#x3001;&#x4E0A;&#x6D77;&#xFF0C;&#x6574;&#x4F53;&#x5206;&#x5E03;&#x6CA1;&#x6709;&#x592A;&#x5927;&#x53D8;&#x5316;&#xFF0C;&#x8FD9;&#x4E0E; IT &#x4EA7;&#x4E1A;&#x7684;&#x6574;&#x4F53;&#x5E03;&#x5C40;&#x76F8;&#x543B;&#x5408;&#x3002;&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x6CB3;&#x5357;&#x7701;&#x7528;&#x6237;&#x6570;&#x589E;&#x591A;&#xFF0C;&#x9996;&#x6B21;&#x8FDB;&#x5165;&#x5730;&#x57DF;&#x5206;&#x5E03;&#x524D;&#x5341;&#x4F4D;&#x3002;</p>
<h2 id="&#x4E8C;&#x3001;&#x5F00;&#x6E90;&#x6CBB;&#x7406;&#x4E0E;&#x793E;&#x533A;">&#x4E8C;&#x3001;&#x5F00;&#x6E90;&#x6CBB;&#x7406;&#x4E0E;&#x793E;&#x533A;</h2>
<p>2019 &#x5E74;&#xFF0C;&#x5F00;&#x6E90;&#x754C;&#x7CBE;&#x5F69;&#x7EB7;&#x5448;&#xFF0C;&#x5F00;&#x6E90;&#x53D7;&#x5230;&#x4E86;&#x524D;&#x6240;&#x672A;&#x6709;&#x7684;&#x5173;&#x6CE8;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x5F00;&#x59CB;&#x5173;&#x6CE8;&#x548C;&#x4E86;&#x89E3;&#x5F00;&#x6E90;&#x6587;&#x5316;&#x3001;&#x89C4;&#x5219;&#xFF0C;&#x5F00;&#x59CB;&#x8BA4;&#x8BC6;&#x5230;&#x793E;&#x533A;&#x7684;&#x91CD;&#x8981;&#x6027;&#xFF0C;&#x5F00;&#x59CB;&#x5C1D;&#x8BD5;&#x53C2;&#x4E0E;&#x5F00;&#x6E90;&#x3002;&#x6211;&#x4EEC;&#x4ECE; Gitee &#x7684;&#x6570;&#x636E;&#x4E5F;&#x6355;&#x6349;&#x5230;&#x4E86;&#x8FD9;&#x4E00;&#x53D8;&#x5316;&#x3002;</p>
<h3 id="21--&#x5F00;&#x6E90;&#x8BB8;&#x53EF;&#x8BC1;">2.1  &#x5F00;&#x6E90;&#x8BB8;&#x53EF;&#x8BC1;</h3>
<p>&#x5F00;&#x53D1;&#x8005;&#x5BF9;&#x5F00;&#x6E90;&#x8BB8;&#x53EF;&#x8BC1;&#x7684;&#x5173;&#x6CE8;&#x548C;&#x89C4;&#x5219;&#x610F;&#x8BC6;&#x5728;&#x9010;&#x6E10;&#x52A0;&#x5F3A;&#xFF0C;2019 &#x5E74;&#xFF0C;Gitee &#x4F7F;&#x7528;&#x5F00;&#x6E90;&#x534F;&#x8BAE;&#x7684;&#x4ED3;&#x5E93;&#x5360;&#x6BD4; &#x63D0;&#x5347;&#x81F3; 72%&#x3002;</p>
<p>2019 &#x5E74; 8 &#x6708;&#xFF0C;Gitee &#x7387;&#x5148;&#x652F;&#x6301;&#x4E2D;&#x56FD;&#x5F00;&#x6E90;&#x8BB8;&#x53EF;&#x8BC1; &#x2014;&#x2014; &#x6728;&#x5170;&#x5BBD;&#x677E;&#x8BB8;&#x53EF;&#x8BC1;&#x3002;&#x76EE;&#x524D;&#xFF0C; Gitee &#x4E0A;&#x4F7F;&#x7528;&#x6728;&#x5170;&#x5BBD;&#x677E;&#x8BB8;&#x53EF;&#x8BC1;&#x7684;&#x5F00;&#x6E90;&#x4ED3;&#x5E93;&#x5DF2;&#x7ECF;&#x8D85;&#x8FC7; 4000 &#x4E2A;&#x3002;</p>
<h3 id="22--&#x5F00;&#x6E90;&#x7EC4;&#x7EC7;">2.2  &#x5F00;&#x6E90;&#x7EC4;&#x7EC7;</h3>
<p>Gitee &#x7684;&#x5F00;&#x6E90;&#x7EC4;&#x7EC7;&#x6570;&#x91CF;&#x5728; 2019 &#x5E74;&#x4EE5;&#x6708;&#x5747; 24.46% &#x901F;&#x5EA6;&#x6301;&#x7EED;&#x589E;&#x957F;&#x3002;</p>
<p>&#x968F;&#x7740;&#x5404;&#x5927;&#x79D1;&#x6280;&#x4F01;&#x4E1A;&#x5BF9;&#x5F00;&#x6E90;&#x7684;&#x5173;&#x6CE8;&#x6301;&#x7EED;&#x5347;&#x6E29;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x4F18;&#x79C0;&#x7684;&#x5F00;&#x6E90;&#x7EC4;&#x7EC7;&#x9646;&#x7EED;&#x5165;&#x9A7B; Gitee&#xFF0C;&#x5982;&#x817E;&#x8BAF;&#x84DD;&#x9CB8;&#x667A;&#x4E91; &#x4E0E;  TARS&#x3001;&#x6EF4;&#x6EF4;&#x5F00;&#x6E90;&#x3001;&#x534E;&#x4E3A;&#x9E3F;&#x8499;&#xFF08; HarmonyOS &#xFF09;&#x4E0E;&#x6B27;&#x62C9;&#xFF08;openEuler&#xFF09;&#x3001;&#x8682;&#x8681;&#x91D1;&#x670D; SOFASTACK &#x4E0E; AntV&#x3001;&#x5317;&#x4EAC;&#x5927;&#x5B66;&#x6570;&#x5B57;&#x89C6;&#x9891;&#x7F16;&#x89E3;&#x7801;&#x6280;&#x672F;&#x56FD;&#x5BB6;&#x5DE5;&#x7A0B;&#x5B9E;&#x9A8C;&#x5BA4;&#x89C6;&#x9891;&#x7F16;&#x7801;&#x7EC4;&#x3001;&#x5FAE;&#x4F17;&#x94F6;&#x884C;&#xFF08;WeBank&#xFF09;&#x3001;&#x79D1;&#x5B66;&#x5927;&#x6570;&#x636E;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x7B49;&#x3002;</p>
<h3 id="23--&#x534F;&#x4F5C;&#x65B9;&#x5F0F;">2.3  &#x534F;&#x4F5C;&#x65B9;&#x5F0F;</h3>
<p>2019 &#x5E74;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x8FC8;&#x51FA;&#x4E86;&#x53C2;&#x4E0E;&#x793E;&#x533A;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#x2014;&#x2014;&#x63D0;&#x4E86;&#x7B2C;&#x4E00;&#x4E2A; Issue/PR&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x597D;&#x7684;&#x8D8B;&#x52BF;&#x3002;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x4EBA;&#x9009;&#x62E9;&#x4F7F;&#x7528; Issue &#x6765;&#x53CD;&#x9988;&#x95EE;&#x9898;&#x3001;&#x4F7F;&#x7528; PR &#x6765;&#x53C2;&#x4E0E;&#x4EE3;&#x7801;&#x8D21;&#x732E;&#xFF0C;&#x4EE5;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x53C2;&#x4E0E;&#x5F00;&#x6E90;&#x534F;&#x4F5C;&#x3002;&#x6211;&#x4EEC;&#x76F8;&#x4FE1;&#xFF0C;&#x672A;&#x6765;&#x4F1A;&#x6709;&#x66F4;&#x591A;&#x5F00;&#x53D1;&#x8005;&#x4EE5;&#x66F4;&#x201C;&#x5F00;&#x6E90;&#x201D;&#x7684;&#x65B9;&#x5F0F;&#x53C2;&#x4E0E;&#x5F00;&#x6E90;&#xFF0C;&#x53C2;&#x4E0E;&#x9879;&#x76EE;&#x548C;&#x793E;&#x533A;&#x7684;&#x6210;&#x957F;&#xFF0C;&#x611F;&#x53D7;&#x5F00;&#x6E90;&#x6240;&#x5E26;&#x6765;&#x7684;&#x4FBF;&#x5229;&#x548C;&#x6B23;&#x559C;&#x3002;</p>
<p><strong>Issue</strong></p>
<ul>
<li>2019 &#x5E74;&#xFF0C;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684; Issue &#x6570;&#x6BD4;&#x53BB;&#x5E74;&#x589E;&#x957F; 84.42% &#xFF0C;&#x6709; 3.8 &#x4E07;&#x5F00;&#x53D1;&#x8005;&#x7B2C;&#x4E00;&#x6B21;&#x5728; Gitee &#x63D0; Issue&#xFF0C;&#x53C2;&#x4E0E;&#x5F00;&#x6E90;&#x3002;</li>
<li>&#x7ED3;&#x5408;&#x529F;&#x80FD;&#x5206;&#x7C7B;&#x7684;&#x7EF4;&#x5EA6;&#x6765;&#x770B;&#xFF0C;WEB&#x5E94;&#x7528;&#x5F00;&#x53D1;-&#x540E;&#x53F0;&#x7BA1;&#x7406;&#x6846;&#x67B6;&#x7684;&#x8BA8;&#x8BBA;&#x5EA6;&#x6700;&#x9AD8;&#xFF0C;Issue &#x6570;&#x5360;&#x6BD4; 32.58%&#xFF0C;&#x6BD4;&#x7B2C;&#x4E8C;&#x4F4D;&#x7684;&#x6570;&#x636E;&#x5E93;&#x5F00;&#x53D1;&#x5305;&#x529F;&#x80FD;&#x4E0B;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x591A;&#x51FA; 27.5%&#xFF0C;&#x4EE5;&#x7EDD;&#x5BF9;&#x4F18;&#x52BF;&#x5360;&#x636E;&#x7B2C;&#x4E00;&#x3002;</li>
<li>&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x65B0;&#x589E; Issue &#x6570;&#x6700;&#x591A;&#xFF1A;</li>
</ul>
<p><img src="images/3-gitee-9.jpg" alt=""></p>
<p><strong>Pull Request</strong></p>
<ul>
<li>Pull Request &#x6570;&#x6BD4;&#x53BB;&#x5E74;&#x589E;&#x957F; 48.96% &#x3002;</li>
</ul>
<h3 id="24--&#x6350;&#x8D60;&#x5F00;&#x6E90;">2.4  &#x6350;&#x8D60;&#x5F00;&#x6E90;</h3>
<p>&#x9664;&#x4E86;&#x63D0; Issue &#x548C; PR&#xFF0C;&#x4E5F;&#x6709;&#x4E9B;&#x4EBA;&#x9009;&#x62E9;&#x66F4;&#x201C;&#x76F4;&#x63A5;&#x201D;&#x7684;&#x65B9;&#x5F0F;&#x8868;&#x8FBE;&#x4E86;&#x5BF9;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x8BA4;&#x53EF;&#xFF0C;2016 &#x5E74;&#xFF0C;Gitee &#x6B63;&#x5F0F;&#x4E0A;&#x7EBF;&#x4E86;&#x6350;&#x8D60;&#x529F;&#x80FD;&#x3002;2019 &#x5E74;&#xFF0C;&#x8FD1; 2000 &#x4F4D;&#x5F00;&#x53D1;&#x8005;&#x7B2C;&#x4E00;&#x6B21;&#x5728; Gitee &#x5BF9;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x6350;&#x8D60;&#xFF0C;&#x56DE;&#x9988;&#x5F00;&#x6E90;&#x3002;</p>
<h3 id="25--gvp-&#x53C2;&#x4E0E;&#x5EA6;&#x5206;&#x6790;">2.5  GVP &#x53C2;&#x4E0E;&#x5EA6;&#x5206;&#x6790;</h3>
<p>GVP ( Gitee most Valuable Project ) - Gitee &#x6700;&#x6709;&#x4EF7;&#x503C;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x8BA1;&#x5212;&#xFF0C;&#x662F;&#x7ECF;&#x7EFC;&#x5408;&#x8BC4;&#x5B9A;&#x4F18;&#x9009;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x5C55;&#x793A;&#x5E73;&#x53F0;&#xFF0C;&#x7ECF;&#x4E24;&#x5E74;&#x591A;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x5DF2;&#x6709; 200 &#x4F59;&#x4E2A;&#x9879;&#x76EE;&#xFF0C;&#x5176;&#x4E2D;&#xFF0C;2019 &#x5E74;&#x6709; 93 &#x4E2A;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x5165;&#x9009; GVP &#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x9879;&#x76EE;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x53CD;&#x6620;&#x4E86;&#x672C;&#x571F;&#x4F18;&#x79C0;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7; Gitee &#x6307;&#x6570;&#x3001;Star&#x3001;Issue&#x3001;Pull Request&#x3001;&#x8D21;&#x732E;&#x8005;&#x7B49;&#x7EF4;&#x5EA6;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x4E86;&#x5206;&#x6790;&#xFF1A;</p>
<p><strong>&#x7EFC;&#x5408;&#x5206;&#x6790;</strong></p>
<p>Gitee &#x6307;&#x6570;&#x662F; 2018 &#x5E74;&#x5E95;&#x63A8;&#x51FA;&#x7684;&#x4E00;&#x9879;&#x529F;&#x80FD;&#xFF0C;&#x4ECE;&#x4EE3;&#x7801;&#x6D3B;&#x8DC3;&#x5EA6;&#x3001;&#x793E;&#x533A;&#x6D3B;&#x8DC3;&#x5EA6;&#x3001;&#x56E2;&#x961F;&#x5065;&#x5EB7;&#x3001;&#x6D41;&#x884C;&#x8D8B;&#x52BF;&#x3001;&#x5F71;&#x54CD;&#x529B;&#x8FD9; 5 &#x4E2A;&#x7EF4;&#x5EA6;&#x5BF9;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x8FDB;&#x884C;&#x5206;&#x6790;&#xFF0C;&#x4EE5;&#x76F4;&#x89C2;&#x6570;&#x503C;&#x7684;&#x5F62;&#x5F0F;&#x6765;&#x5C55;&#x793A;&#x5BF9;&#x4E00;&#x4E2A;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x5404;&#x65B9;&#x4F4D;&#x7684;&#x6307;&#x6807;&#x7EFC;&#x5408;&#x5EA6;&#x91CF;&#x3002;</p>
<ul>
<li>&#x5728; 2019 &#x5E74; Gitee &#x6307;&#x6570;&#x6392;&#x540D;&#x524D; 50 &#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x4E2D;&#xFF0C;GVP &#x5360;&#x636E; 41 &#x4E2A;&#x5E2D;&#x4F4D;&#xFF0C;Gitee &#x6307;&#x6570;&#x666E;&#x904D;&#x8D85;&#x8FC7; 80 &#x5206;&#x3002;</li>
</ul>
<p><strong>2019 GVP- Gitee &#x6307;&#x6570;&#x6392;&#x540D; TOP 10</strong></p>
<p><img src="images/3-gitee-10.jpg" alt=""></p>
<p><strong>Star&#x3001;Issue&#x3001;Pull Request</strong></p>
<ul>
<li>2019 &#x5E74; Gitee &#x65B0;&#x589E; Star &#x6700;&#x591A;&#x7684; TOP 50 &#x5F00;&#x6E90;&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x6709; 37 &#x4E2A; GVP  &#x9879;&#x76EE;&#x3002;</li>
<li>2019 &#x5E74;&#xFF0C;&#x5E73;&#x5747;&#x6BCF;&#x4E2A; GVP &#x9879;&#x76EE;&#x7684; Issue &#x6570;&#x6BD4;&#x53BB;&#x5E74;&#x589E;&#x957F; 119%&#xFF0C;Pull Request &#x6570;&#x589E;&#x957F; 71%&#x3002;</li>
</ul>
<p><strong>&#x8D21;&#x732E;&#x8005;</strong></p>
<ul>
<li>2019 &#x5E74;&#xFF0C;&#x6709; 79% &#x7684; GVP &#x9879;&#x76EE;&#x65B0;&#x589E;&#x8D85;&#x8FC7; 2 &#x4F4D;&#x8D21;&#x732E;&#x8005;&#xFF0C;50% &#x7684; GVP &#x9879;&#x76EE;&#x8D21;&#x732E;&#x8005;&#x589E;&#x957F;&#x8D85;&#x8FC7; 5 &#x4EBA;&#x3002;GVP &#x9879;&#x76EE;&#x8D21;&#x732E;&#x8005;&#x4EBA;&#x6570;&#x5206;&#x5E03;&#x60C5;&#x51B5;&#xFF1A;</li>
</ul>
<p><img src="images/3-gitee-11.jpg" alt=""></p>
<p>GVP &#x9879;&#x76EE;&#x8D21;&#x732E;&#x8005;&#x4EBA;&#x6570;&#x666E;&#x904D;&#x8F83;&#x591A;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x53CD;&#x6620;&#x51FA;&#x6709;&#x66F4;&#x591A;&#x5F00;&#x53D1;&#x8005;&#x613F;&#x610F;&#x4E3A;&#x4F18;&#x79C0;&#x9879;&#x76EE;&#x8D21;&#x732E;&#x4EE3;&#x7801;&#xFF0C;&#x6210;&#x4E3A;&#x793E;&#x533A;&#x7684;&#x4E00;&#x5458;&#xFF1B;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x4E5F;&#x4F53;&#x73B0;&#x4E86;&#x8FD0;&#x4F5C;&#x826F;&#x597D;&#x7684;&#x793E;&#x533A;&#x5BF9;&#x9879;&#x76EE;&#x5065;&#x5EB7;&#x6210;&#x957F;&#x7684;&#x610F;&#x4E49;&#x3002;</p>
<blockquote>
<p>&#x4EE3;&#x7801;&#x4E0E;&#x793E;&#x533A;&#x662F;&#x76F8;&#x8F85;&#x76F8;&#x6210;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x4F18;&#x8D28;&#x7684;&#x9879;&#x76EE;&#x603B;&#x662F;&#x53EF;&#x4EE5;&#x5438;&#x5F15;&#x66F4;&#x591A;&#x8D21;&#x732E;&#x8005;&#xFF0C;&#x800C;&#x793E;&#x533A;&#x4E5F;&#x4E3A;&#x9879;&#x76EE;&#x6210;&#x957F;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x591A;&#x7075;&#x611F;&#x4E0E;&#x529B;&#x91CF;&#x3002;&#x6211;&#x4EEC;&#x671F;&#x5F85;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x5F00;&#x53D1;&#x8005;&#x4EE5;&#x66F4;&#x9AD8;&#x6548;&#x3001;&#x793E;&#x533A;&#x5316;&#x7684;&#x65B9;&#x5F0F;&#x53C2;&#x4E0E;&#x5F00;&#x6E90;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x5728;&#x793E;&#x533A;&#x4E2D;&#x6C72;&#x53D6;&#x8425;&#x517B;&#x3001;&#x53D1;&#x5C55;&#x58EE;&#x5927;&#x3002;
&#x2014;&#x2014; Gitee.com&#xFF08;&#x7EDF;&#x8BA1;&#x622A;&#x81F3; 2019 &#x5E74; 12 &#x6708; 20 &#x65E5;&#xFF09;</p>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="data-grank.html" class="navigation navigation-prev " aria-label="Previous page: Grank 分析">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="insight.html" class="navigation navigation-next " aria-label="Next page: 洞察篇">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Gitee 分析","level":"1.4.2","depth":2,"next":{"title":"洞察篇","level":"1.5","depth":1,"path":"insight.md","ref":"insight.md","articles":[]},"previous":{"title":"Grank 分析","level":"1.4.1","depth":2,"path":"data-grank.md","ref":"data-grank.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"开源社","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"2019 中国开源年度报告","gitbook":"*","description":"2019 中国开源年度报告"},"file":{"path":"data-gitee.md","mtime":"2020-01-01T13:41:35.613Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-01-01T15:05:24.204Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

