
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>问卷篇 · 2019 中国开源年度报告</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="开源社">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="perface.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="perface.html">
            
                <a href="perface.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="investigation.html">
            
                <a href="investigation.html">
            
                    
                    问卷篇
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    数据篇
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="data-grank.html">
            
                <a href="data-grank.html">
            
                    
                    Grank 分析
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="data-gitee.html">
            
                <a href="data-gitee.html">
            
                    
                    Gitee 分析
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="insight.html">
            
                <a href="insight.html">
            
                    
                    洞察篇
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="conclusion.html">
            
                <a href="conclusion.html">
            
                    
                    结语
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="thankyou.html">
            
                <a href="thankyou.html">
            
                    
                    感谢
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >问卷篇</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x95EE;&#x5377;&#x7BC7;">&#x95EE;&#x5377;&#x7BC7;</h1>
<h2 id="&#x4E00;&#x3001;&#x62A5;&#x544A;&#x6982;&#x8FF0;">&#x4E00;&#x3001;&#x62A5;&#x544A;&#x6982;&#x8FF0;</h2>
<h3 id="11-&#x80CC;&#x666F;">1.1 &#x80CC;&#x666F;</h3>
<p>2015&#x5E74;&#xFF0C;&#x5F00;&#x6E90;&#x793E;&#x53D1;&#x5E03;&#x4E86;&#x300A;2015&#x5E74;&#x4E2D;&#x56FD;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x53C2;&#x4F1A;&#x8C03;&#x67E5;&#x62A5;&#x544A;&#x300B;&#xFF0C;2018&#x5E74;&#xFF0C; &#x5F00;&#x6E90;&#x793E;&#x6301;&#x7EED;&#x53D1;&#x5E03;&#x4E86;&#x300A;2018&#x5E74;&#x4E2D;&#x56FD;&#x5F00;&#x6E90;&#x5F00;&#x53D1;&#x8005;&#x8C03;&#x67E5;&#x300B;&#xFF0C; &#x5BF9;&#x4E2D;&#x56FD;&#x7684;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x3001;&#x5F00;&#x6E90;&#x751F;&#x6001;&#x3001;&#x5F00;&#x6E90;&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x505A;&#x4E86;&#x4E00;&#x6B21;&#x5168;&#x9762;&#x7684;&#x6478;&#x5E95;&#x8C03;&#x67E5;&#xFF0C;&#x4E5F;&#x5F97;&#x5230;&#x4E00;&#x7CFB;&#x5217;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x4FE1;&#x606F;&#x3002;</p>
<p>2019&#x5E74;&#xFF0C; &#x5728;&#x793E;&#x533A;&#x6210;&#x5458;&#x7684;&#x671F;&#x5F85;&#x4E2D;&#xFF0C; &#x5F00;&#x6E90;&#x793E;&#x793E;&#x533A;&#x6210;&#x5458;&#x518D;&#x6B21;&#x81EA;&#x53D1;&#x5F62;&#x6210;&#x4E86;2019&#x5E74;&#x5E74;&#x5EA6;&#x62A5;&#x544A;&#x5C0F;&#x7EC4;&#xFF0C; &#x518D;&#x6B21;&#x7B79;&#x5907;&#x300A;2019&#x4E2D;&#x56FD;&#x5F00;&#x6E90;&#x53C2;&#x4E0E;&#x8C03;&#x67E5;&#x62A5;&#x544A;&#x300B;&#xFF0C; &#x8FD9;&#x4E00;&#x6B21;&#x6211;&#x4EEC;&#x5BF9;&#x95EE;&#x5377;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x8BDD;&#x9898;&#x7B49;&#x6709;&#x4E86;&#x66F4;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x4FEE;&#x6B63;&#x548C;&#x5B8C;&#x5584;&#xFF0C;&#x4EE5;&#x4F53;&#x73B0;&#x51FA;&#x6280;&#x672F;&#x4E00;&#x65E5;&#x5343;&#x91CC;&#x7684;&#x6F8E;&#x6E43;&#x53D1;&#x5C55;&#x8D8B;&#x52BF;&#x3002; &#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x4E86;&#x89E3;&#x7684;&#xFF0C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x8FD9;&#x4E00;&#x5E74;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x66F4;&#x5E0C;&#x671B;&#x901A;&#x8FC7;&#x6570;&#x636E;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x53D1;&#x73B0;&#x4E00;&#x4E9B;&#x503C;&#x5F97;&#x5173;&#x6CE8;&#x7684;&#x8D8B;&#x52BF;&#x3002;&#x5E0C;&#x671B;&#x901A;&#x8FC7;&#x9605;&#x8BFB;&#x8FD9;&#x4EFD;&#x62A5;&#x544A;&#xFF0C; &#x8BA9;&#x6211;&#x4EEC;&#x5BF9;&#x4E8E;&#x4E2D;&#x56FD;&#x5F00;&#x6E90;&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x6709;&#x4E86;&#x66F4;&#x52A0;&#x6DF1;&#x5165;&#x7684;&#x4E86;&#x89E3;&#xFF0C;&#x4E5F;&#x5BF9;&#x4E8E;&#x672A;&#x6765;&#x6280;&#x672F;&#x6F6E;&#x6D41;&#xFF0C;&#x6709;&#x4E86;&#x4E00;&#x4E9B;&#x91CD;&#x8981;&#x7684;&#x6D1E;&#x89C1;&#xFF01;</p>
<p>&#x5E0C;&#x671B;&#x8FD9;&#x6837;&#x7684;&#x8C03;&#x67E5;&#x62A5;&#x544A;&#xFF0C;&#x80FD;&#x591F;&#x4E3A;&#x5E7F;&#x5927;&#x5F00;&#x6E90;&#x53C2;&#x4E0E;&#x8005;&#xFF0C;&#x4ECE;&#x4E1A;&#x8005;&#xFF0C;&#x4EE5;&#x53CA;&#x53C2;&#x4E0E;&#x5F00;&#x6E90;&#x7684;&#x4F01;&#x4E1A;&#xFF0C;&#x63D0;&#x4F9B;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x53C2;&#x8003;&#x3002;</p>
<ul>
<li>&#x8C03;&#x67E5;&#x5BF9;&#x8C61;&#xFF1A;&#x8986;&#x76D6;&#x5F00;&#x53D1;&#x8005;&#x3001; &#x793E;&#x533A;&#x6210;&#x5458;&#x3001; &#x8D21;&#x732E;&#x8005;&#x3001; &#x5B66;&#x751F;&#x3001; &#x653F;&#x5E9C;&#x4F01;&#x4E1A;&#x7BA1;&#x7406;&#x4EBA;&#x5458;</li>
<li>&#x8C03;&#x67E5;&#x5185;&#x5BB9;&#xFF1A;&#x4E3B;&#x8981;&#x6DB5;&#x76D6;&#x4E2A;&#x4EBA;&#x4FE1;&#x606F;&#x3001; &#x5DE5;&#x4F5C;&#x72B6;&#x51B5;&#x3001; &#x5F00;&#x6E90;&#x793E;&#x533A;&#x4EE5;&#x53CA;&#x5F00;&#x53D1;&#x8005;&#x6280;&#x672F;&#x8C03;&#x67E5;</li>
<li>&#x8C03;&#x67E5;&#x65B9;&#x6CD5;&#xFF1A;&#x4EE5;&#x5728;&#x7EBF;&#x95EE;&#x5377;&#x65B9;&#x5F0F;&#x641C;&#x96C6;&#x6837;&#x672C;&#x548C;&#x6570;&#x636E;&#xFF0C; &#x4EA4;&#x53C9;&#x5BF9;&#x6BD4;&#x6CD5;&#x5206;&#x6790;&#x6570;&#x636E;</li>
<li>&#x63A8;&#x5E7F;&#x65B9;&#x6CD5;&#xFF1A;&#x7EBF;&#x4E0A;&#x793E;&#x4EA4;&#x5A92;&#x4F53;&#xFF0C;&#x535A;&#x5BA2;&#xFF0C;&#x5F00;&#x6E90;&#x793E;&#xFF0C;&#x5F00;&#x6E90;&#x4E2D;&#x56FD;&#xFF0C; CSDN &#x7F51;&#x7AD9;&#xFF0C;Linux &#x4E2D;&#x56FD;&#x5F00;&#x6E90;&#x793E;&#x533A;&#xFF1B;&#x7EBF;&#x4E0B;&#x4EE5;&#x6C99;&#x9F99;&#x8BBA;&#x575B;&#x5927;&#x578B;&#x4F1A;&#x8BAE;&#x7B49;&#x6E20;&#x9053;&#x641C;&#x96C6;&#x95EE;&#x5377;</li>
<li>&#x95EE;&#x9898;&#x6570;&#x91CF;&#xFF1A;59</li>
<li>&#x95EE;&#x9898;&#x7C7B;&#x578B;&#xFF1A; &#x5355;&#x9009;&#xFF0C;&#x591A;&#x9009;&#xFF0C;&#x5F00;&#x653E;&#x6027;</li>
<li>&#x6837;&#x672C;&#x91CF;&#xFF1A;618</li>
</ul>
<h3 id="12-&#x7279;&#x9080;&#x4E13;&#x5BB6;">1.2 &#x7279;&#x9080;&#x4E13;&#x5BB6;</h3>
<p>&#x848B;&#x6D9B;        CSDN &#x521B;&#x59CB;&#x4EBA; &amp; &#x8463;&#x4E8B;&#x957F;&#xFF0C;&#x6781;&#x5BA2;&#x5E2E;&#x521B;&#x6295;&#x521B;&#x59CB;&#x5408;&#x4F19;&#x4EBA;</p>
<p>&#x7EA2;&#x85AF;        &#x5F00;&#x6E90;&#x4E2D;&#x56FD; &#x521B;&#x59CB;&#x4EBA; &amp; CTO</p>
<p>&#x4E25;&#x5251;&#x5CF0;     &#x5FAE;&#x8F6F;&#x9996;&#x5E2D;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#xFF0C;&#x5FAE;&#x8F6F;&#x5F00;&#x53D1;&#x5E73;&#x53F0;&#x4E8B;&#x4E1A;&#x90E8;</p>
<p>&#x5835;&#x4FCA;&#x5E73;     &#x817E;&#x8BAF;&#x5F00;&#x6E90;&#x8054;&#x76DF;&#x4E3B;&#x5E2D;</p>
<p>&#x5218;&#x6D01;         &#x534E;&#x4E3A;&#x5F00;&#x6E90;&#x6218;&#x7565;&#x4E13;&#x5BB6;</p>
<p>&#x6ED5;&#x7231;&#x9F84;     &#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x5F00;&#x6E90;&#x4E8B;&#x52A1;&#x603B;&#x76D1;</p>
<p>&#x738B;&#x5174;&#x5B87;     Linux &#x4E2D;&#x56FD;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x521B;&#x59CB;&#x4EBA;</p>
<h2 id="&#x4E8C;&#x3001;&#x91CD;&#x8981;&#x53D1;&#x73B0;">&#x4E8C;&#x3001;&#x91CD;&#x8981;&#x53D1;&#x73B0;</h2>
<p>&#x901A;&#x8FC7;&#x5206;&#x6790;2019&#x5E74;&#x7684;&#x7EDF;&#x8BA1;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x4E14;&#x5BF9;&#x6BD4;2018&#x5E74;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4EE5;&#x53CA;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x627E;&#x5230;&#x7684;&#x5176;&#x4ED6;&#x4E00;&#x4E9B;&#x516C;&#x5F00;&#x53D1;&#x5E03;&#x7684;&#x7EDF;&#x8BA1;&#x62A5;&#x544A;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x4E86;&#x5982;&#x4E0B;&#x4E00;&#x4E9B;&#x91CD;&#x8981;&#x53D1;&#x73B0;&#xFF1A;</p>
<ul>
<li>&#x5973;&#x6027;&#x53C2;&#x4E0E;&#x8005;&#x6BD4;&#x4F8B;&#x6B63;&#x5728;&#x4E0A;&#x5347;&#xFF0C;2018&#x5E74;&#x4E3A;12%&#xFF0C;2019&#x5E74;&#x4E0A;&#x5347;&#x5230;16%&#xFF0C;&#x5973;&#x6027;&#x53C2;&#x4E0E;&#x5F00;&#x6E90;&#x6BD4;&#x4F8B;&#x9010;&#x5E74;&#x90FD;&#x5728;&#x7A33;&#x5B9A;&#x589E;&#x957F;&#xFF0C;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x901A;&#x8FC7;&#x5404;&#x79CD;&#x65B9;&#x5F0F;&#x4E00;&#x76F4;&#x5728;&#x9F13;&#x52B1;&#x5973;&#x6027;&#x7684;&#x53C2;&#x4E0E;&#xFF0C;&#x7A81;&#x51FA;&#x591A;&#x6837;&#x6027;&#x3002; </li>
<li>&#x5F00;&#x6E90;&#x53C2;&#x4E0E;&#x8005;&#xFF0C;20~39&#x5C81;&#x4EBA;&#x7FA4;&#x662F;&#x7EDD;&#x5BF9;&#x4E3B;&#x529B;&#xFF0C;&#x8D85;&#x8FC7;85%&#x3002;&#x76F8;&#x8F83;&#x4E8E; 2018 &#x5E74;&#xFF0C;30 &#x5C81;&#x4EE5;&#x4E0A;&#x4EBA;&#x7FA4;&#x6BD4;&#x4F8B;&#x6709;&#x8F83;&#x5927;&#x63D0;&#x5347;&#xFF0C;&#x8BF4;&#x660E;&#x6709;&#x66F4;&#x591A;&#x8D44;&#x6DF1;&#x4ECE;&#x4E1A;&#x8005;&#x4E00;&#x76F4;&#x5728;&#x6301;&#x7EED;&#x53C2;&#x4E0E;&#x5F00;&#x6E90;&#x3002;</li>
<li>&#x6709; 6 &#x6210;&#x4EE5;&#x4E0A;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x5C5E;&#x4E8E;&#x4E92;&#x8054;&#x7F51;&#x884C;&#x4E1A;&#xFF0C;&#x76F8;&#x8F83; 2018 &#x5E74;&#x4E0B;&#x964D;&#x4E86; 10&#x4E2A;&#x767E;&#x5206;&#x70B9;&#xFF0C;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#x5176;&#x4ED6;&#x884C;&#x4E1A;&#x53C2;&#x4E0E;&#x8005;&#x6BD4;&#x4F8B;&#x5927;&#x5E45;&#x589E;&#x52A0;&#xFF0C;&#x5982;&#x7535;&#x4FE1;/&#x901A;&#x4FE1;&#x3001;&#x91D1;&#x878D;/&#x94F6;&#x884C;&#x7B49;&#xFF0C;&#x5F00;&#x6E90;&#x6B63;&#x5728;&#x6E17;&#x900F;&#x5165;&#x5404;&#x4E2A;&#x884C;&#x4E1A;&#x3002;</li>
<li>&#x5F00;&#x6E90;&#x5F00;&#x53D1;&#x8005;&#x6536;&#x5165;&#x6C34;&#x5E73;&#x666E;&#x904D;&#x8F83;&#x9AD8;&#xFF0C;&#x8FD1;6&#x6210;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x6708;&#x6536;&#x5165;&#x5728;1.5&#x4E07;&#x4EE5;&#x4E0A;&#x5143;&#x3002;&#x6536;&#x5165;&#x5728; 1.5-3&#x4E07;&#x8FD9;&#x4E2A;&#x533A;&#x95F4;&#x7684;&#x6BD4;&#x4F8B;&#x4ECE;2018&#x5E74;&#x7684; 27.35% &#x589E;&#x957F;&#x5230; 39%&#x3002;&#x6708;&#x85AA;&#x8D85; 3 &#x4E07;&#x8005;&#x4ECE; 2018 &#x5E74;&#x7684; 12.5% &#x5927;&#x5E45;&#x4E0A;&#x5347;&#x81F3; 26%&#xFF0C;&#x8FD9;&#x4E0E;&#x8D44;&#x6DF1;&#x4ECE;&#x4E1A;&#x4EBA;&#x5458;&#x6570;&#x91CF;&#x589E;&#x591A;&#x6709;&#x5173;&#x3002;&#x9AD8;&#x6536;&#x5165;&#x4EBA;&#x7FA4;&#x4F8B;&#x5982;5&#x4E07;&#x4EE5;&#x4E0A;&#xFF0C;&#x5728;2015&#x5E74;&#x65F6;1.5%&#xFF0C; &#x5728;2018&#x5E74;&#x662F;4.8%&#xFF0C; 2019&#x5E74;&#x5219;&#x589E;&#x957F;&#x5230;6%&#x3002; </li>
<li>&#x5728;&#x5438;&#x5F15;&#x7528;&#x6237;&#x4F7F;&#x7528;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x7684;&#x7406;&#x7531;&#x65B9;&#x9762;&#xFF0C;&#x8282;&#x7701;&#x5F00;&#x53D1;&#x6210;&#x672C;&#x4E00;&#x76F4;&#x90FD;&#x4E0D;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x56E0;&#x7D20;&#x3002;&#x901A;&#x8FC7;&#x5BF9;&#x6BD4;&#x6570;&#x636E;&#x8FD8;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x8FD1;&#x5E74;&#x6765;&#xFF0C;&#x5927;&#x5BB6;&#x5BF9;&#x4E8E;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x7684;&#x652F;&#x6301;&#x4E0E;&#x5F00;&#x6E90;&#x7CBE;&#x795E;&#x4E0E;&#x7406;&#x5FF5;&#x7684;&#x91CD;&#x89C6;&#xFF0C;&#x6B63;&#x5728;&#x9010;&#x6B65;&#x4E0A;&#x5347;&#x3002;</li>
<li>&#x76F8;&#x8F83;&#x4E8E; 2018 &#x5E74;&#x6709;&#x8D85; 8 &#x6210;&#x5F00;&#x53D1;&#x8005;&#x4ECE;&#x672A;&#x6216;&#x5F88;&#x5C11;&#x4ECE;&#x5F00;&#x6E90;&#x83B7;&#x5F97;&#x6536;&#x5165;&#xFF0C;2019 &#x5E74;&#x65F6;&#x8FD9;&#x4E2A;&#x6BD4;&#x4F8B;&#x5DF2;&#x7ECF;&#x4E0B;&#x964D;&#x5230;&#x4E86; 53%&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x770B;&#x5230;&#x6709;8%&#x7684;&#x4EBA;&#x81EA;&#x6211;&#x8BC4;&#x4EF7;&#x901A;&#x8FC7;&#x5F00;&#x6E90;&#x83B7;&#x5F97;&#x4E86;&#x5F88;&#x591A;&#x7684;&#x6536;&#x5165;&#x3002;&#x4ECE;&#x5F00;&#x6E90;&#x4E2D;&#x83B7;&#x5F97;&#x6536;&#x5165;&#x7684;&#x6BD4;&#x4F8B;&#x5927;&#x5E45;&#x589E;&#x52A0;&#xFF0C;&#x5F00;&#x6E90;&#x4EA7;&#x4E1A;&#x751F;&#x6001;&#x6B63;&#x5728;&#x9010;&#x6B65;&#x5B8C;&#x5584;&#x3002;</li>
<li>&#x4F20;&#x7EDF;&#x90AE;&#x4EF6;&#x5217;&#x8868;&#x3001;&#x5FAE;&#x4FE1;&#x7FA4;&#x548C;QQ&#x4F9D;&#x7136;&#x662F;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x4EA4;&#x6D41;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x5177;&#xFF0C;&#x4F46;&#x5F02;&#x519B;&#x7A81;&#x8D77;&#x7684;&#x65B0;&#x9510; Slack &#x6B63;&#x5728;&#x5FEB;&#x901F;&#x541E;&#x566C;&#x5E02;&#x573A;&#xFF0C;Zoom &#x4F9D;&#x7136;&#x662F;&#x89C6;&#x9891;&#x4EA4;&#x6D41;&#x7684;&#x91CD;&#x8981;&#x5DE5;&#x5177;&#x3002;</li>
<li>&#x5C31;&#x6280;&#x672F;&#x9886;&#x57DF;&#x800C;&#x8A00;&#xFF0C;AI&#x5F00;&#x53D1;&#x8005;&#x4ECE;2018&#x5E74;&#x7684;4%&#x63D0;&#x5347;&#x5230;8%&#xFF0C;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x9886;&#x57DF;&#x6B63;&#x5728;&#x4E0E;&#x5F00;&#x6E90;&#x7D27;&#x5BC6;&#x7ED3;&#x5408;&#xFF0C;&#x84EC;&#x52C3;&#x53D1;&#x5C55;&#x3002;</li>
</ul>
<h2 id="&#x4E09;&#x3001;&#x5F00;&#x53D1;&#x8005;&#x7FA4;&#x4F53;&#x7279;&#x5F81;">&#x4E09;&#x3001;&#x5F00;&#x53D1;&#x8005;&#x7FA4;&#x4F53;&#x7279;&#x5F81;</h2>
<h3 id="31-&#x53C2;&#x4E0E;&#x8005;&#x666E;&#x904D;&#x5E74;&#x8F7B;&#x4E14;&#x5B66;&#x5386;&#x8F83;&#x9AD8;&#xFF0C;&#x7537;&#x6027;&#x5360;&#x516B;&#x6210;&#x4EE5;&#x4E0A;">3.1 &#x53C2;&#x4E0E;&#x8005;&#x666E;&#x904D;&#x5E74;&#x8F7B;&#x4E14;&#x5B66;&#x5386;&#x8F83;&#x9AD8;&#xFF0C;&#x7537;&#x6027;&#x5360;&#x516B;&#x6210;&#x4EE5;&#x4E0A;</h3>
<p>&#x53C2;&#x4E0E;&#x8005;&#x4E2D;80&#x540E;&#x548C;90&#x540E;&#x662F;&#x4E3B;&#x529B;&#x519B;&#x3002;&#x666E;&#x904D;&#x53D7;&#x6559;&#x80B2;&#x7A0B;&#x5EA6;&#x8F83;&#x9AD8;&#xFF0C;&#x5176;&#x4E2D;&#x672C;&#x79D1;&#x53CA;&#x4EE5;&#x4E0A;&#x5B66;&#x5386;&#x7684;&#x5360;&#x5230;&#x4E86;&#x516B;&#x6210;&#x3002;&#x7537;&#x6027;&#x5360;&#x6BD4;&#x8FBE;&#x5230;&#x4E86;84%&#xFF0C;&#x5973;&#x6027;&#x53C2;&#x4E0E;&#x8005;&#x4E3A;16%&#xFF0C;&#x76F8;&#x6BD4;&#x4E8E;2018&#x5E74;&#x7684;12%&#x6709;&#x6240;&#x63D0;&#x9AD8;&#x3002;</p>
<p><img src="images/1-investigation-1.png" alt="">
&#x6837;&#x672C;&#x91CF;&#xFF1A;618</p>
<hr>
<p>&#x3010;&#x5835;&#x4FCA;&#x5E73;&#x70B9;&#x8BC4;&#x3011;&#xFF1A;&#x5F00;&#x53D1;&#x8005;&#x8D8B;&#x4E8E;&#x5E74;&#x8F7B;&#x5316;&#xFF0C;&#x8BF4;&#x660E;&#x6709;&#x66F4;&#x591A;&#x7684;&#x6709;&#x751F;&#x529B;&#x91CF;&#x6295;&#x5165;&#x5230;&#x6280;&#x672F;&#x7684;&#x7814;&#x53D1;&#x5DE5;&#x4F5C;&#x4E2D;&#x6765;&#xFF0C;&#x5BF9;&#x4E8E;&#x5F00;&#x6E90;&#x672A;&#x6765;&#x7684;&#x6301;&#x7EED;&#x53D1;&#x5C55;&#x662F;&#x4E00;&#x4EF6;&#x91CD;&#x5927;&#x7684;&#x5229;&#x597D;&#x6D88;&#x606F;&#x3002;&#x5E74;&#x8F7B;&#x7684;&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x5FC3;&#x6001;&#x4E0A;&#x66F4;&#x4E3A;&#x5F00;&#x653E;&#xFF0C;&#x751F;&#x6D3B;&#x4E0A;&#x7684;&#x538B;&#x529B;&#x66F4;&#x5C0F;&#xFF0C;&#x66F4;&#x613F;&#x610F;&#x8FFD;&#x968F;&#x81EA;&#x5DF1;&#x7684;&#x5185;&#x5FC3;&#x4E0E;&#x5174;&#x8DA3;&#x3002;&#x800C;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#xFF0C;&#x65E2;&#x662F;&#x4ED6;/&#x5979;&#x4EEC;&#x5FEB;&#x901F;&#x6210;&#x957F;&#x7684;&#x5B66;&#x6821;&#xFF0C;&#x4E5F;&#x63D0;&#x4F9B;&#x4E86;&#x5145;&#x5206;&#x5C55;&#x793A;&#x81EA;&#x5DF1;&#x624D;&#x534E;&#x7684;&#x821E;&#x53F0;&#x3002;&#x5973;&#x6027;&#x5F00;&#x53D1;&#x8005;&#x6570;&#x91CF;&#x4E0A;&#x5347;&#x4E5F;&#x662F;&#x597D;&#x4E8B;&#xFF0C;&#x5F00;&#x6E90;&#x5929;&#x751F;&#x5C31;&#x662F;&#x8981;&#x6253;&#x7834;&#x58C1;&#x5792;&#xFF0C;&#x91CA;&#x653E;&#x6F5C;&#x80FD;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x671F;&#x5F85;&#x66F4;&#x591A;&#x7684;&#x5973;&#x6027;&#x5DE5;&#x7A0B;&#x5E08;&#x52A0;&#x5165;&#x5230;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x4E2D;&#x6765;&#x3002;</p>
<p>&#x3010;&#x4E25;&#x5251;&#x5CF0;&#x70B9;&#x8BC4;&#x3011;: &#x5C0F;&#x4E8E;20&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x5360;&#x6BD4;&#x504F;&#x5C0F;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x5E74;&#x9F84;&#x6BB5;&#x5E94;&#x8BE5;&#x5305;&#x62EC;&#x4E86;&#x8FD1;1&#x534A;&#x5DE6;&#x53F3;&#x7684;&#x5728;&#x6821;&#x5927;&#x5B66;&#x751F;&#xFF0C;&#x8FD8;&#x6709;&#x9AD8;&#x4E2D;&#x751F;&#x4EEC;&#x3002;&#x4ED6;&#x4EEC;&#x4EE3;&#x8868;&#x4E86;&#x5F00;&#x6E90;&#x7684;&#x672A;&#x6765;&#x3002;&#x671F;&#x5F85;&#x66F4;&#x591A;&#x5E74;&#x8F7B;&#x4EBA;&#x53C2;&#x4E0E;&#x5230;&#x5F00;&#x6E90;&#x4E2D;&#x6765;&#x3002;&#x540C;&#x65F6;&#x4E5F;&#x8981;&#x5173;&#x6CE8;&#x65B0;&#x4E00;&#x4EE3;&#x5F00;&#x6E90;&#x529B;&#x91CF;&#x4E3B;&#x8981;&#x7684;&#x6C9F;&#x901A;&#x6E20;&#x9053;&#x548C;&#x4FE1;&#x606F;&#x6765;&#x6E90;&#xFF0C;&#x548C;&#x4F20;&#x7EDF;&#x7684;&#x6E20;&#x9053;&#x76F8;&#x6BD4;&#x6709;&#x4F55;&#x53D8;&#x5316;&#x3002;</p>
<p>&#x3010;&#x5218;&#x6D01;&#x70B9;&#x8BC4;&#x3011;: &#x5BF9;&#x201C;&#x7A0B;&#x5E8F;&#x5458;&#x5F62;&#x8C61;&#x201D;&#x7684;&#x8D1F;&#x9762;&#x793E;&#x4F1A;&#x8BA4;&#x77E5;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x963B;&#x788D;&#x66F4;&#x591A;&#x65B0;&#x751F;&#x529B;&#x91CF;&#x52A0;&#x5165;&#x7684;&#x8BF1;&#x56E0;&#x3002;2000&#x5E74;&#x5DE6;&#x53F3;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x662F;&#x5F53;&#x5E74;&#x7684;&#x201C;&#x6F6E;&#x6D41;&#x9752;&#x5E74;&#x201D;&#xFF0C;&#x4EE3;&#x8868;&#x5F53;&#x65F6;&#x7684;&#x201C;&#x9AD8;&#x5B66;&#x5386;/&#x9AD8;&#x6536;&#x5165;/&#x9AD8;&#x79D1;&#x6280;&#x201D;&#x7684;&#x9AD8;&#x5BCC;&#x5E05;&#x4EBA;&#x7FA4;&#x3002;&#x4F46;&#x8FD1;&#x5E74;&#x6765;&#x5173;&#x4E8E;&#x5F00;&#x53D1;&#x8005;&#xFF08;&#x7A0B;&#x5E8F;&#x5458;&#xFF09;&#x7684;&#x5A92;&#x4F53;&#x62A5;&#x9053;&#x6574;&#x4F53;&#x8D8B;&#x4E8E;&#x8D1F;&#x9762;&#xFF0C;&#x8FC7;&#x4E8E;&#x653E;&#x5927;&#x4E86;&#x201C;&#x65E0;&#x4E2A;&#x4EBA;&#x65F6;&#x95F4;&#x3001;&#x4E0D;&#x4F1A;&#x4EAB;&#x53D7;&#x751F;&#x6D3B;&#x7B49;&#x201D;&#x7684;&#x673A;&#x68B0;&#x5316;&#x87BA;&#x4E1D;&#x9489;&#x5F62;&#x8C61;&#xFF0C;&#x8FD9;&#x4E9B;&#x7279;&#x5F81;&#xFF0C;&#x5BF9;&#x4E8E;&#x201C;&#x8FFD;&#x6C42;&#x81EA;&#x6211;&#x4EF7;&#x503C;&#x201D;&#x7684;&#x65B0;&#x751F;&#x4EE3;&#xFF0C;&#x5F88;&#x96BE;&#x518D;&#x4EA7;&#x751F;&#x7C7B;&#x4F3C;2000&#x5E74;&#x5DE6;&#x53F3;&#x7684;&#x5438;&#x5F15;&#x529B;&#x3002;</p>
<h3 id="32-&#x4ECE;&#x4E1A;&#x65F6;&#x95F4;">3.2 &#x4ECE;&#x4E1A;&#x65F6;&#x95F4;</h3>
<p>&#x53C2;&#x4E0E;&#x8005;&#x4E2D;&#x6709;&#x4E94;&#x6210;&#x5DE5;&#x4F5C;&#x65F6;&#x95F4;&#x4E0D;&#x8DB3;5&#x5E74;&#xFF0C;&#x5DE5;&#x4F5C;6-10&#x5E74;&#x5360;&#x6BD4;&#x6700;&#x5927;&#xFF0C;3-5&#x5E74;&#x548C;10-15&#x5E74;&#x6B21;&#x4E4B;&#x3002;</p>
<p><img src="images/1-investigation-2.png" alt="">
&#x6837;&#x672C;&#x91CF;&#xFF1A;368</p>
<hr>
<p>&#x3010;&#x5218;&#x6D01;&#x70B9;&#x8BC4;&#x3011;&#x53C2;&#x4E0E;&#x672C;&#x6B21;&#x8C03;&#x7814;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x4E2D;&#xFF0C;&#x5047;&#x8BBE;&#x8FD8;&#x672A;&#x5DE5;&#x4F5C;&#x7684;&#x201C;&#x6709;&#x624D;&#x6709;&#x95F2;&#x201D;&#x7684;&#x662F;&#x5728;&#x6821;&#x5B66;&#x751F;&#xFF0C;&#x6BD4;&#x4F8B;&#x7ADF;&#x7136;&#x53EA;&#x5360;2%&#xFF08;&#x4E0D;&#x6392;&#x9664;&#x4E00;&#x90E8;&#x5206;&#x9AD8;&#x5B66;&#x5386;&#x5B66;&#x751F;&#x5DF2;&#x7ECF;&#x6709;&#x80FD;&#x529B;&#x83B7;&#x5F97;&#x6536;&#x5165;&#xFF0C;&#x6216;&#x8005;&#x5B9A;&#x4E49;&#x4E3A;&#x81EA;&#x5DF1;&#x5DF2;&#x7ECF;&#x5728;&#x5DE5;&#x4F5C;&#xFF09;&#x3002;&#x4E2A;&#x4EBA;&#x4EE5;&#x4E3A;&#x5438;&#x5F15;&#x66F4;&#x591A;&#x5B66;&#x751F;&#x52A0;&#x5165;&#x5230;&#x5F00;&#x6E90;&#x4E2D;&#x6765;&#x6709;&#x4E24;&#x4E2A;&#x5173;&#x952E;&#x70B9;&#xFF1A;&#x8BB2;&#x6E05;&#x4EF7;&#x503C;&#x6FC0;&#x53D1;&#x5174;&#x8DA3;&#xFF1A;&#x8BB2;&#x6E05;&#x695A;&#x5F00;&#x6E90;&#x5BF9;&#x5B66;&#x751F;&#x7684;&#x6280;&#x80FD;&#x3001;&#x5C31;&#x4E1A;&#x3001;&#x4E2A;&#x4EBA;&#x6210;&#x957F;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x8F85;&#x4EE5;&#x76F4;&#x89C2;&#x7684;&#x4E2A;&#x4EBA;&#x6210;&#x529F;&#x6848;&#x4F8B;&#xFF09;&#xFF1B;&#x964D;&#x4F4E;&#x95E8;&#x69DB;&#x5438;&#x5F15;&#x6295;&#x5165;&#xFF1A;&#x666E;&#x53CA;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x7684;n&#x79CD;&#x7ECF;&#x5178;&#x6210;&#x957F;&#x8DEF;&#x5F84;&#xFF0C;&#x540C;&#x65F6;&#x8F85;&#x4EE5;&#x8F83;&#x4F4E;&#x7684;&#x793E;&#x533A;&#x8D21;&#x732E;&#x51C6;&#x5165;&#x95E8;&#x69DB;&#xFF0C;&#x5438;&#x5F15;&#x5B66;&#x751F;&#x6295;&#x5165;&#x5C1D;&#x8BD5;&#x3002;</p>
<p>&#x3010;&#x7F16;&#x8005;&#x6309;&#x3011;&#x672C;&#x6B21;&#x8C03;&#x7814;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x9664;&#x4E86;&#x5728;&#x793E;&#x4EA4;&#x5A92;&#x4F53;&#x4E0A;&#x53D1;&#x5E03;&#xFF0C; &#x6BD4;&#x8F83;&#x4E3B;&#x8981;&#x7684;&#x4E00;&#x4E2A;&#x6E20;&#x9053;&#x662F;&#x7EBF;&#x4E0B;&#x7684;&#x5927;&#x4F1A;&#xFF0C; &#x5B66;&#x751F;&#x53C2;&#x4E0E;&#x4E1A;&#x754C;&#x5927;&#x4F1A;&#x7684;&#x6BD4;&#x4F8B;&#x4E00;&#x76F4;&#x504F;&#x4F4E;&#x3002; &#x6216;&#x8005;&#x5E94;&#x8BE5;&#x6362;&#x4E00;&#x4E2A;&#x601D;&#x8DEF;&#xFF0C; &#x5F00;&#x6E90;&#x793E;&#x5E94;&#x8BE5;&#x8D70;&#x8FDB;&#x5B66;&#x751F;&#x7684;&#x6E20;&#x9053;&#xFF0C; &#x4F5C;&#x66F4;&#x6709;&#x6548;&#x7684;&#x63A8;&#x5E7F;&#x548C;&#x6559;&#x80B2;&#x3002;</p>
<p>&#x3010;&#x738B;&#x5174;&#x5B87;&#x70B9;&#x8BC4;&#x3011;&#x53EF;&#x80FD;&#x786E;&#x5B9E;&#x5982;&#x7F16;&#x8005;&#x6309;&#x6240;&#x8FF0;&#xFF0C;&#x672C;&#x6B21;&#x7684;&#x8C03;&#x67E5;&#x6837;&#x672C;&#x6709;&#x6240;&#x504F;&#x79BB;&#x5BFC;&#x81F4;&#x5E74;&#x8F7B;&#x4EBA;&#x5360;&#x6BD4;&#x6BD4;&#x8F83;&#x5C11;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6839;&#x636E; Linux &#x4E2D;&#x56FD;&#x7684;&#x7FFB;&#x8BD1;&#x5FD7;&#x613F;&#x8005;&#x7684;&#x5E74;&#x9F84;&#x5206;&#x5E03;&#x6765;&#x770B;&#xFF0C;&#x5927;&#x5B66;&#x751F;&#x53C2;&#x4E0E;&#x7684;&#x6BD4;&#x4F8B;&#x662F;&#x6BD4;&#x8F83;&#x9AD8;&#x7684;&#x3002;&#x5982;&#x679C;&#x4ECE;&#x6280;&#x672F;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x7684;&#x786E;&#x53EF;&#x80FD;&#x4E00;&#x4E9B;&#x5DE5;&#x4F5C;&#x4E86;3-5&#x5E74;&#x7684;&#x4EBA;&#x5728;&#x5F00;&#x6E90;&#x9886;&#x57DF;&#x66F4;&#x5177;&#x5907;&#x7ADE;&#x4E89;&#x529B;&#xFF0C;&#x4F46;&#x5F00;&#x6E90;&#x5E76;&#x4E0D;&#x53EA;&#x662F;&#x4EE3;&#x7801;&#xFF0C;&#x6216;&#x8BB8;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6709;&#x66F4;&#x591A;&#x7684;&#x65B9;&#x5F0F;&#x53BB;&#x544A;&#x8BC9;&#x5728;&#x6821;&#x751F;&#x3001;&#x8FDB;&#x5165;&#x804C;&#x573A; 1-2 &#x5E74;&#x7684;&#x4EBA;&#xFF0C;&#x4F60;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x8D21;&#x732E;&#x5F00;&#x6E90;&#x3002;</p>
<h3 id="33-&#x884C;&#x4E1A;&#x9886;&#x57DF;">3.3 &#x884C;&#x4E1A;&#x9886;&#x57DF;</h3>
<p>&#x53C2;&#x4E0E;&#x8C03;&#x67E5;&#x8005;&#x4E2D;&#xFF0C;&#x6709;67%&#x7684;&#x8C03;&#x67E5;&#x8005;&#x5C31;&#x804C;&#x4E8E;&#x4E92;&#x8054;&#x7F51;&#x5F00;&#x53D1;/&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x9886;&#x57DF;&#xFF0C;&#x5176;&#x6B21;&#x7535;&#x4FE1;/&#x901A;&#x4FE1;&#x9886;&#x57DF;&#x7684;&#x5360;&#x6709;6.47%&#xFF0C;&#x91D1;&#x878D;&#x4FDD;&#x9669;&#x884C;&#x4E1A;&#x5360;&#x6BD4;5%&#xFF0C;&#x4E5F;&#x5728;&#x79EF;&#x6781;&#x53C2;&#x4E0E;&#x5F00;&#x6E90;&#x3002; &#x76F8;&#x6BD4;&#x4E8E;2018&#x5E74;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x5F00;&#x53D1;/&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x9886;&#x57DF;&#x4EE5;&#x5916;&#x7684;&#x5176;&#x5B83;&#x9886;&#x57DF;&#x5360;&#x6BD4;&#x4E0A;&#x5347;&#x4E86;15%&#x3002;</p>
<p><img src="images/1-investigation-3.png" alt="">
&#x6837;&#x672C;&#x91CF;&#xFF1A;368</p>
<hr>
<p>&#x3010;&#x738B;&#x5174;&#x5B87;&#x70B9;&#x8BC4;&#x3011;&#x76F8;&#x6BD4;&#x4E8E;2018 &#x5E74;&#xFF0C;2019 &#x5E74;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x4E92;&#x8054;&#x7F51;&#x9886;&#x57DF;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x6BD4;&#x91CD;&#x5728;&#x964D;&#x4F4E;&#xFF0C;&#x5176;&#x4ED6;&#x9886;&#x57DF;&#x548C;&#x884C;&#x4E1A;&#x7684;&#x6BD4;&#x91CD;&#x5728;&#x589E;&#x591A;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x5F00;&#x6E90;&#x7684;&#x529B;&#x91CF;&#x4E0D;&#x5728;&#x4EC5;&#x4EC5;&#x5C40;&#x9650;&#x4E8E;&#x4E92;&#x8054;&#x7F51;&#x4F01;&#x4E1A;&#xFF0C;&#x4ED6;&#x4EEC;&#x5F00;&#x59CB;&#x9010;&#x6E10;&#x6E17;&#x900F;&#x5230;&#x8FC7;&#x53BB;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x6240;&#x65E0;&#x6CD5;&#x89E6;&#x8FBE;&#x7684;&#x9886;&#x57DF;&#x548C;&#x884C;&#x4E1A;&#x3002;&#x63A5;&#x8FD1; 40% &#x7684;&#x5360;&#x6BD4;&#x4E5F;&#x662F;&#x503C;&#x5F97;&#x6B23;&#x559C;&#x7684;&#xFF0C;&#x5728;&#x672A;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x5C06;&#x770B;&#x5230;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x5360;&#x9886;&#x5404;&#x884C;&#x5404;&#x4E1A;&#x3002;</p>
<h3 id="34-&#x804C;&#x4F4D;&#x5206;&#x5E03;">3.4 &#x804C;&#x4F4D;&#x5206;&#x5E03;</h3>
<p>&#x8D85;&#x8FC7;&#x4E00;&#x534A;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x804C;&#x4F4D;&#x4E3A;&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x4E3B;&#x7BA1;/&#x7ECF;&#x7406;/&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x5360;&#x4E86;25%&#xFF0C;&#x5B66;&#x751F;&#x4EC5;&#x5360;5%&#x3002;</p>
<p><img src="images/1-investigation-4.png" alt="">
&#x6837;&#x672C;&#x91CF;&#xFF1A;618</p>
<hr>
<p>&#x3010;&#x4E25;&#x5251;&#x5CF0;&#x70B9;&#x8BC4;&#x3011;: &#x540C;&#x6837;&#x53CD;&#x6620;&#x51FA;&#x5B66;&#x751F;&#x7FA4;&#x4F53;&#x53C2;&#x4E0E;&#x5EA6;&#x5E94;&#x8BE5;&#x6709;&#x66F4;&#x5927;&#x7684;&#x63D0;&#x5347;&#x7A7A;&#x95F4;&#x3002;&#x662F;&#x5426;&#x4E5F;&#x80FD;&#x6DF1;&#x5165;&#x8C03;&#x7814;&#x4E00;&#x4E0B;&#xFF0C;&#x5F00;&#x6E90;&#x6559;&#x80B2;&#xFF0C;&#x5F00;&#x6E90;&#x6587;&#x5316;&#xFF0C;&#x5F00;&#x6E90;&#x5F71;&#x54CD;&#x5728;&#x5B66;&#x751F;&#x7FA4;&#x4F53;&#x4E2D;&#x5982;&#x4F55;&#x66F4;&#x6709;&#x6548;&#x7684;&#x63A8;&#x5E7F;&#x3002;&#x8FD9;&#x6837;&#x624D;&#x80FD;&#x7ED9;&#x65E5;&#x540E;&#x4E1A;&#x754C;&#x6E90;&#x6E90;&#x4E0D;&#x65AD;&#x8F93;&#x9001;&#x5F00;&#x6E90;&#x4EBA;&#x624D;&#xFF0C;&#x5F62;&#x6210;&#x826F;&#x6027;&#x6C38;&#x7EED;&#x53D1;&#x5C55;&#x3002;</p>
<p>&#x3010;&#x5218;&#x6D01;&#x70B9;&#x8BC4;&#x3011;&#x4E00;&#x4E2A;&#x5B66;&#x751F;&#x5982;&#x679C;&#x6CA1;&#x6BD5;&#x4E1A;&#xFF0C;&#x4F46;&#x5199;&#x4EE3;&#x7801;&#xFF0C;&#x4ED6;&#x7684;&#x81EA;&#x6211;&#x8BA4;&#x77E5;&#x53EF;&#x80FD;&#x66F4;&#x503E;&#x5411;&#x4E8E;&#x9009;&#x62E9;&#x201C;&#x5F00;&#x53D1;&#x8005;&#x201D;&#x8EAB;&#x4EFD;&#x3002;</p>
<h3 id="35-&#x6536;&#x5165;&#x6C34;&#x5E73;">3.5 &#x6536;&#x5165;&#x6C34;&#x5E73;</h3>
<p>&#x5F00;&#x6E90;&#x5F00;&#x53D1;&#x8005;&#x6536;&#x5165;&#x6C34;&#x5E73;&#x666E;&#x904D;&#x8F83;&#x9AD8;&#xFF0C;&#x8FD1;6&#x6210;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x6708;&#x6536;&#x5165;&#x8D85;&#x8FC7;1.4&#x4E07;&#x5143;&#x3002;&#x6536;&#x5165;&#x5728; 1.5-3&#x4E07; &#x8FD9;&#x4E2A;&#x533A;&#x95F4;&#x7684;&#x6BD4;&#x4F8B;&#x4ECE;2018&#x5E74;&#x7684; 26.27% &#x589E;&#x957F;&#x5230; 39%&#x3002;5&#x4E07;&#x6708;&#x85AA;&#x4EE5;&#x4E0A;&#x7684;&#x9AD8;&#x6536;&#x5165;&#x4EBA;&#x7FA4;&#xFF0C;&#x5728;2018&#x5E74;&#x662F;4.8%&#xFF0C; 2019&#x5E74;&#x589E;&#x957F;&#x5230;6%&#x3002; </p>
<p><img src="images/1-investigation-5.png" alt="">
&#x6837;&#x672C;&#x91CF;&#xFF1A;618</p>
<h3 id="36-&#x5F00;&#x6E90;&#x793E;&#x533A;&#x4E2D;&#x6536;&#x5165;&#x548C;&#x804C;&#x4E1A;&#x7684;&#x5173;&#x7CFB;">3.6 &#x5F00;&#x6E90;&#x793E;&#x533A;&#x4E2D;&#x6536;&#x5165;&#x548C;&#x804C;&#x4E1A;&#x7684;&#x5173;&#x7CFB;</h3>
<p>&#x5B66;&#x751F;&#x4E2D;&#x6709;16.7%&#x7684;&#x6BD4;&#x4F8B;&#x662F;&#x6709;&#x6536;&#x5165;&#x7684;&#xFF0C;&#x4E14;&#x6536;&#x5165;&#x8303;&#x56F4;&#x5728;5K-1.4W&#x4E4B;&#x95F4;&#x3002; &#x6708;&#x85AA;&#x8D85;&#x8FC7;5W&#x7684;&#x9AD8;&#x6536;&#x5165;&#x4EBA;&#x7FA4;&#x4E3B;&#x8981;&#x4EE5;&#x4F01;&#x4E1A;&#x9AD8;&#x7BA1;&#xFF0C;CEO/CTO&#xFF0C; &#x5F00;&#x53D1;&#x8005;&#x548C;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x4E3A;&#x4E3B;&#x3002; </p>
<p><img src="images/1-investigation-6.png" alt=""></p>
<h2 id="&#x56DB;&#x3001;&#x5F00;&#x6E90;&#x5DE5;&#x4F5C;&#x73B0;&#x72B6;">&#x56DB;&#x3001;&#x5F00;&#x6E90;&#x5DE5;&#x4F5C;&#x73B0;&#x72B6;</h2>
<h3 id="41-&#x5728;&#x5F00;&#x6E90;&#x4E2D;&#x7684;&#x65F6;&#x95F4;&#x6295;&#x5165;">4.1 &#x5728;&#x5F00;&#x6E90;&#x4E2D;&#x7684;&#x65F6;&#x95F4;&#x6295;&#x5165;</h3>
<p>&#x53C2;&#x4E0E;&#x8005;&#x6BCF;&#x5468;&#x6295;&#x5165;&#x7684;&#x5F00;&#x6E90;&#x65F6;&#x95F4;&#x4E2D;&#xFF0C;44%&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x6BCF;&#x5468;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x957F;&#x4E0D;&#x8DB3;5&#x5C0F;&#x65F6;&#xFF0C;28%&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x6BCF;&#x5468;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x65F6;&#x957F;&#x4E3A;5-10&#x5C0F;&#x65F6;&#x3002;</p>
<p><img src="images/1-investigation-7.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;579</p>
<hr>
<p>&#x3010;&#x4E25;&#x5251;&#x5CF0;&#x70B9;&#x8BC4;&#x3011;: &#x503C;&#x5F97;&#x63A2;&#x8BA8;&#x4E00;&#x4E0B;&#xFF0C;&#x76EE;&#x524D;&#x56FD;&#x5185;&#x666E;&#x904D;&#x7684;&#x91CD;&#x6295;&#x5165;&#xFF0C;&#x91CD;&#x77ED;&#x671F;&#x56DE;&#x62A5;&#xFF0C;&#x91CD;&#x7ED3;&#x679C;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x548C;&#x4F01;&#x4E1A;&#x6587;&#x5316;&#xFF0C;&#x662F;&#x5426;&#x67D0;&#x79CD;&#x5F62;&#x5F0F;&#x4E0B;&#x6324;&#x538B;&#x4E86;&#x5F00;&#x6E90;&#x7684;&#x53D1;&#x5C55;&#x7A7A;&#x95F4;&#xFF1F;</p>
<p>&#x3010;&#x5218;&#x6D01;&#x70B9;&#x8BC4;&#x3011;&#x5F00;&#x6E90;&#x8D21;&#x732E;&#x662F;&#x591A;&#x5143;&#x5316;&#x7684;&#xFF0C;&#x4E0D;&#x53EA;&#x9650;&#x4E8E;&#x4EE3;&#x7801;&#x8D21;&#x732E;&#xFF0C;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x4E2D;&#x672C;&#x8EAB;&#x4E5F;&#x5B58;&#x5728;&#x591A;&#x79CD;&#x89D2;&#x8272;&#x548C;&#x804C;&#x80FD;&#xFF0C;&#x5F00;&#x6E90;&#x8FD0;&#x8425;&#x8FC7;&#x7A0B;&#x4E2D;&#x6709;&#x8BB8;&#x591A;&#x770B;&#x4F3C;&#x201C;&#x6280;&#x672F;&#x542B;&#x91CF;&#x4E0D;&#x9AD8;&#x4F46;&#x5374;&#x4E0D;&#x53EF;&#x6216;&#x7F3A;&#x201D;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x5982;&#x4F55;&#x5728;&#x5F00;&#x6E90;&#x5E03;&#x9053;/&#x8FD0;&#x8425;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x505A;&#x5230;&#x5BF9;&#x5F00;&#x6E90;&#x201C;&#x65B0;&#x4EBA;&#x201D;&#x53CB;&#x597D;&#xFF0C;&#x4F7F;&#x5176;&#x5FEB;&#x901F;&#x5EFA;&#x7ACB;&#x201C;&#x5176;&#x5B9E;&#x81EA;&#x5DF1;&#x53EF;&#x4EE5;&#x53C2;&#x4E0E;&#x5176;&#x4E2D;&#x5E76;&#x6709;&#x6240;&#x8D21;&#x732E;&#x201D;&#x7684;&#x8BA4;&#x77E5;&#xFF0C;&#x662F;&#x5F00;&#x6E90;&#x80FD;&#x5426;&#x53EF;&#x6301;&#x7EED;&#x53D1;&#x5C55;&#x4E0B;&#x53BB;&#x7684;&#x5173;&#x952E;&#x56E0;&#x7D20;&#x3002;</p>
<p>&#x3010;&#x7EA2;&#x85AF;&#x70B9;&#x8BC4;&#x3011;&#x56FD;&#x5185;&#x5F00;&#x53D1;&#x8005;&#x666E;&#x904D;&#x9762;&#x4E34;&#x52A0;&#x73ED;&#x4E25;&#x91CD;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x6324;&#x5360;&#x4E86;&#x5728;&#x5DE5;&#x4F5C;&#x4E4B;&#x4F59;&#x53C2;&#x4E0E;&#x5F00;&#x6E90;&#x7684;&#x65F6;&#x95F4;&#x548C;&#x7CBE;&#x529B;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x5927;&#x80CC;&#x666F;&#x4E0B;&#xFF0C;&#x4ECD;&#x6709;1/3&#x4EE5;&#x4E0A;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x6295;&#x5165;&#x4E86;&#x8F83;&#x591A;&#x7CBE;&#x529B;&#xFF0C;&#x5BA2;&#x89C2;&#x6765;&#x8BB2;&#x5DF2;&#x662F;&#x503C;&#x5F97;&#x6B23;&#x559C;&#x7684;&#x3002;&#x53C2;&#x4E0E;&#x5F00;&#x6E90;&#x4E5F;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x81EA;&#x6211;&#x603B;&#x7ED3;&#x548C;&#x6C89;&#x6DC0;&#x3001;&#x6280;&#x672F;&#x4EA4;&#x6D41;&#x3001;&#x4E43;&#x81F3;&#x953B;&#x70BC;&#x7EC4;&#x7EC7;&#x80FD;&#x529B;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x968F;&#x7740;&#x66F4;&#x591A;&#x7684;&#x4F01;&#x4E1A;&#x548C;&#x5F00;&#x53D1;&#x8005;&#x4E86;&#x89E3;&#x548C;&#x8BA4;&#x53EF;&#x5F00;&#x6E90;&#x6587;&#x5316;&#xFF0C;&#x76F8;&#x4FE1;&#x6211;&#x4EEC;&#x4F1A;&#x770B;&#x5230;&#x66F4;&#x591A;&#x7684;&#x6295;&#x5165;&#x3002; </p>
<h3 id="42-&#x63A5;&#x89E6;&#x5F00;&#x6E90;&#x7684;&#x65F6;&#x95F4;">4.2 &#x63A5;&#x89E6;&#x5F00;&#x6E90;&#x7684;&#x65F6;&#x95F4;</h3>
<p>&#x4E09;&#x6210;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x63A5;&#x89E6;&#x5F00;&#x6E90;&#x65F6;&#x95F4;&#x5728;3&#x5230;5&#x5E74;&#xFF0C;&#x516B;&#x6210;&#x4EE5;&#x4E0A;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x63A5;&#x89E6;&#x5F00;&#x6E90;&#x65F6;&#x95F4;&#x5728;1&#x5E74;&#x4EE5;&#x4E0A;&#x3002;&#x63A5;&#x89E6;&#x5F00;&#x6E90;10&#x5E74;&#x4EE5;&#x4E0A;&#x7684;&#x6BD4;&#x4F8B;&#x4E3A;9%&#x3002;</p>
<p><img src="images/1-investigation-7.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;618</p>
<hr>
<p>&#x3010;&#x4E25;&#x5251;&#x5CF0;&#x70B9;&#x8BC4;&#x3011;: &#x4E5F;&#x53CD;&#x5E94;&#x51FA;&#x5B66;&#x751F;&#x5728;&#x5B66;&#x6821;&#x91CC;&#x63A5;&#x89E6;&#x7684;&#x5F00;&#x6E90;&#x4E0D;&#x591F;&#x591A;&#xFF0C;&#x4E0D;&#x591F;&#x65E9;&#x3002;&#x76F8;&#x6BD4;&#x8F83;&#x56FD;&#x5916;&#x5927;&#x5B66;&#x8BA1;&#x7B97;&#x673A;&#x76F8;&#x5173;&#x4E13;&#x4E1A;&#x7684;&#x8BFE;&#x7A0B;&#x8BBE;&#x7F6E;&#xFF0C;&#x5F88;&#x591A;&#x4E13;&#x4E1A;&#x8BFE;&#x5C31;&#x662F;&#x56F4;&#x7ED5;&#x4E00;&#x4E2A;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x6DF1;&#x5EA6;&#x8FDB;&#x884C;&#x7684;&#x3002;&#x4E00;&#x4E2A;&#x5B66;&#x671F;&#x4E0B;&#x6765;&#xFF0C;&#x5B66;&#x751F;&#x8981;&#x770B;&#x5B8C;&#x4E00;&#x4E2A;&#x771F;&#x5B9E;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x6240;&#x6709;&#x7684;&#x6E90;&#x4EE3;&#x7801;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x8FC7;&#x91CD;&#x65B0;&#x5199;&#x90E8;&#x5206;&#x529F;&#x80FD;&#x8FDB;&#x884C;&#x76F8;&#x5173;&#x5B66;&#x4E60;&#x3002;&#x8FD9;&#x4E00;&#x8FC7;&#x7A0B;&#x5DF2;&#x7ECF;&#x662F;&#x4E0E;&#x5F00;&#x6E90;&#x6DF1;&#x5EA6;&#x7ED3;&#x5408;&#x4E86;&#x3002;&#x5F53;&#x4ED6;&#x4EEC;&#x8FDB;&#x5165;&#x804C;&#x573A;&#x65F6;&#xFF0C;&#x5DF2;&#x7ECF;&#x662F;&#x6D78;&#x6DA6;&#x5F00;&#x6E90;&#x6709;&#x65F6;&#x65E5;&#x7684;&#x8001;&#x5175;&#x4E86;&#x3002;</p>
<p>&#x3010;&#x5218;&#x6D01;&#x70B9;&#x8BC4;&#x3011;&#x5F00;&#x6E90;&#x8981;&#x4ECE;&#x201C;&#x5B66;&#x751F;&#x201D;&#x6293;&#x8D77;&#xFF01;</p>
<h3 id="43-&#x4ECE;&#x4E8B;&#x7684;&#x6280;&#x672F;&#x65B9;&#x5411;">4.3 &#x4ECE;&#x4E8B;&#x7684;&#x6280;&#x672F;&#x65B9;&#x5411;</h3>
<p>&#x5C31;&#x6280;&#x672F;&#x9886;&#x57DF;&#x800C;&#x8A00;&#xFF0C;&#x540E;&#x7AEF;&#x5F00;&#x53D1;&#x5360;&#x636E;&#x4E86;&#x8FD1;&#x4E09;&#x5206;&#x4E4B;&#x4E00;&#x7684;&#x4EFD;&#x989D;&#xFF0C;Web&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x8005;&#x548C;&#x4E91;&#x8BA1;&#x7B97;&#x5F00;&#x53D1;&#x8005;&#x5360;&#x636E;&#x4E86;&#x699C;&#x773C;&#x548C;&#x63A2;&#x82B1;&#x7684;&#x4F4D;&#x7F6E;&#x3002; &#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;AI&#x5F00;&#x53D1;&#x8005;&#x4ECE;&#x53BB;&#x5E74;&#x7684;4%&#x63D0;&#x5347;&#x5230;8%&#xFF0C;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x9886;&#x57DF;&#x6B63;&#x5728;&#x4E0E;&#x5F00;&#x6E90;&#x7D27;&#x5BC6;&#x7ED3;&#x5408;&#xFF0C;&#x84EC;&#x52C3;&#x53D1;&#x5C55;&#x3002;&#x4F01;&#x4E1A;&#x7684;&#x9AD8;&#x7EA7;&#x7BA1;&#x7406;&#x8005;&#x5360;&#x636E;&#x4E86;5%&#xFF0C; &#x8BF4;&#x660E;&#x4F01;&#x4E1A;&#x5BF9;&#x4E8E;&#x5F00;&#x6E90;&#x7684;&#x79EF;&#x6781;&#x5173;&#x6CE8;&#x5EA6;&#x3002; </p>
<p><img src="images/1-investigation-9.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;618</p>
<hr>
<p>&#x3010;&#x738B;&#x5174;&#x5B87;&#x70B9;&#x8BC4;&#x3011;&#x4ECE;&#x6211;&#x4EEC;&#x89C2;&#x5BDF;&#x5230;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x6D3B;&#x8DC3;&#x5EA6;&#x800C;&#x8A00;&#xFF0C;&#x524D;&#x7AEF;&#x9879;&#x76EE;&#x7684;&#x6D3B;&#x8DC3;&#x5EA6;&#x8981;&#x8FDC;&#x9AD8;&#x4E8E;&#x540E;&#x7AEF;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x6B64;&#x8C03;&#x67E5;&#x4E2D;&#x540E;&#x7AEF;&#x5F00;&#x53D1;&#x8005;&#x5374;&#x8981;&#x591A;&#x4E8E;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x8FD9;&#x6216;&#x8BB8;&#x8868;&#x660E;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x8005;&#x7684;&#x4E2A;&#x4EBA;&#x8D21;&#x732E;&#x91CF;&#x8981;&#x8FDC;&#x9AD8;&#x4E8E;&#x540E;&#x7AEF;&#x8D21;&#x732E;&#x8005;&#x7684;&#x4E2A;&#x4EBA;&#x8D21;&#x732E;&#x91CF;&#x3002;</p>
<h3 id="44-&#x5F00;&#x6E90;&#x76F8;&#x5173;&#x6D3B;&#x52A8;&#x53C2;&#x4E0E;&#x5EA6;">4.4 &#x5F00;&#x6E90;&#x76F8;&#x5173;&#x6D3B;&#x52A8;&#x53C2;&#x4E0E;&#x5EA6;</h3>
<p>&#x7EDD;&#x5927;&#x591A;&#x6570;&#x53C2;&#x4E0E;&#x8005;&#x53EA;&#x6709;&#x6BCF;&#x5E74;&#x51E0;&#x6B21;&#x7684;&#x53C2;&#x4E0E;&#x3002;&#x5BF9;&#x4E8E;&#x53C2;&#x4E0E;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x548C;&#x9879;&#x76EE;&#xFF0C; &#x7EBF;&#x4E0B;&#x548C;&#x7EBF;&#x4E0A;&#x53C2;&#x4E0E;&#x7684;&#x6BD4;&#x4F8B;&#x6301;&#x5E73;&#x3002; &#x7EBF;&#x4E0B;&#x53C2;&#x4E0E;&#x5927;&#x591A;&#x4EE5;&#x5927;&#x4F1A;&#xFF0C; &#x6C99;&#x9F99;&#xFF0C;&#x8BB2;&#x5EA7;&#x4E3A;&#x4E3B;&#xFF1B;&#x7EBF;&#x4E0A;&#x53C2;&#x4E0E;&#x4EE5;&#x5728;&#x7EBF;&#x4F1A;&#x8BAE;&#xFF0C; &#x90AE;&#x4EF6;&#x5217;&#x8868;&#x8BA8;&#x8BBA;&#xFF0C;PR&#x6D3B;&#x52A8;&#x7B49;&#x4E3A;&#x4E3B;&#x3002;</p>
<p><img src="images/1-investigation-10.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;618</p>
<hr>
<p>&#x3010;&#x738B;&#x5174;&#x5B87;&#x70B9;&#x8BC4;&#x3011;&#x56FD;&#x5185;&#x53EF;&#x80FD;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x95EE;&#x9898;&#x4E0D;&#x662F;&#x53C2;&#x52A0;&#x6D3B;&#x52A8;&#x7684;&#x6570;&#x76EE;&#xFF0C;&#x800C;&#x662F;&#x6CA1;&#x6709;&#x6D3B;&#x52A8;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x6211;&#x4EEC;&#x770B;&#x5230;&#xFF0C;&#x56FD;&#x5185;&#x5E76;&#x6CA1;&#x6709;&#x592A;&#x591A;&#x4E0E;&#x5F00;&#x6E90;&#x76F8;&#x5173;&#x7684;&#x6D3B;&#x52A8;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x7684;&#x90FD;&#x662F;&#x4F01;&#x4E1A;&#x7684;&#x63A8;&#x5E7F;&#x6D3B;&#x52A8;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x56FD;&#x5185;&#x505A;&#x597D;&#x5F00;&#x6E90;&#x6D3B;&#x52A8;&#xFF0C;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x503C;&#x5F97;&#x601D;&#x8003;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<h3 id="45-&#x5F00;&#x6E90;&#x6536;&#x5165;">4.5 &#x5F00;&#x6E90;&#x6536;&#x5165;</h3>
<p>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x591A;&#x6570;&#x4EBA;&#x53C2;&#x4E0E;&#x5F00;&#x6E90;&#x5E76;&#x4E0D;&#x8FFD;&#x6C42;&#x7269;&#x8D28;&#x56DE;&#x62A5;&#xFF0C;&#x4E00;&#x534A;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x6CA1;&#x6709;&#x5F00;&#x6E90;&#x6536;&#x5165;&#xFF0C;28%&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x6536;&#x5165;&#x4E00;&#x822C;&#x6216;&#x5F88;&#x5C11;&#xFF0C;&#x4F46;&#x8FD8;&#x662F;&#x70ED;&#x8877;&#x4E8E;&#x53C2;&#x4E0E;&#x5F00;&#x6E90;&#x5DE5;&#x4F5C;&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x770B;&#x5230;&#x6709;8%&#x7684;&#x4EBA;&#x81EA;&#x6211;&#x8BC4;&#x4EF7;&#x901A;&#x8FC7;&#x5F00;&#x6E90;&#x83B7;&#x5F97;&#x4E86;&#x5F88;&#x591A;&#x7684;&#x6536;&#x5165;&#x3002; </p>
<p><img src="images/1-investigation-11.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;618</p>
<hr>
<p>&#x3010;&#x5835;&#x4FCA;&#x5E73;&#x70B9;&#x8BC4;&#x3011;&#x8FD9;&#x8BF4;&#x660E;&#x5728;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5F00;&#x6E90;&#x8D21;&#x732E;&#x5728;&#x4E2D;&#x56FD;&#x4ECD;&#x7136;&#x6709;&#x5F3A;&#x70C8;&#x7684;&#x5229;&#x4ED6;&#x4E3B;&#x4E49;&#x4E0E;&#x7406;&#x60F3;&#x4E3B;&#x4E49;&#x8272;&#x5F69;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x5F88;&#x591A;&#x5F00;&#x53D1;&#x8005;&#x4ECE;&#x5F00;&#x6E90;&#x4E2D;&#x6536;&#x83B7;&#x5230;&#x76F4;&#x63A5;&#x7684;&#x7269;&#x8D28;&#x56DE;&#x62A5;&#x3002;&#x4ECE;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x800C;&#x8A00;&#xFF0C;&#x8FD9;&#x53CD;&#x5E94;&#x4E86;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x7684;&#x5546;&#x4E1A;&#x5316;&#x8FD8;&#x5904;&#x4E8E;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x521D;&#x671F;&#x7684;&#x6C34;&#x5E73;&#xFF0C;&#x5F00;&#x53D1;&#x8005;&#x80CC;&#x540E;&#x7684;&#x5546;&#x4E1A;&#x516C;&#x53F8;&#x5E76;&#x6CA1;&#x6709;&#x5F88;&#x597D;&#x53D1;&#x6398;&#x51FA;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x5546;&#x4E1A;&#x4EF7;&#x503C;&#xFF0C;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x7684;&#x76C8;&#x5229;&#x6A21;&#x5F0F;&#x4E5F;&#x76F8;&#x5BF9;&#x7B80;&#x5355;&#xFF0C;&#x5B58;&#x5728;&#x7EE7;&#x7EED;&#x63A2;&#x7D22;&#x7684;&#x7A7A;&#x95F4;&#x3002;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x672A;&#x6765;&#x5728;&#x4E2D;&#x56FD;&#xFF0C;&#x6709;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x7684;&#x65E5;&#x5E38;&#x5DE5;&#x4F5C;&#x5373;&#x662F;&#x4E3A;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x505A;&#x8D21;&#x732E;&#xFF0C;&#x6216;&#x8005;&#x4F9D;&#x9760;&#x5F00;&#x6E90;&#x8D21;&#x732E;&#x6765;&#x627E;&#x5230;&#x66F4;&#x597D;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x80FD;&#x5FEB;&#x901F;&#x5D1B;&#x8D77;&#x4E00;&#x6279;&#x5C0F;&#x800C;&#x7F8E;&#x7684;&#x3001;&#x4EE5;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x7814;&#x53D1;&#x4E0E;&#x670D;&#x52A1;&#x4E3A;&#x4E3B;&#x8981;&#x76C8;&#x5229;&#x624B;&#x6BB5;&#x7684;&#x9AD8;&#x79D1;&#x6280;&#x8F6F;&#x4EF6;&#x516C;&#x53F8;&#xFF0C;&#x6765;&#x5BF9;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x7684;&#x5546;&#x4E1A;&#x5316;&#x6F5C;&#x529B;&#x505A;&#x66F4;&#x597D;&#x7684;&#x63A2;&#x7D22;&#x3002;</p>
<p>&#x3010;&#x848B;&#x6D9B;&#x70B9;&#x8BC4;&#x3011;&#x5F00;&#x6E90;&#x5546;&#x4E1A;&#x5316;&#x5728;&#x5168;&#x7403;&#x90FD;&#x662F;&#x4E2A;&#x96BE;&#x9898;&#xFF0C;&#x5F00;&#x6E90;&#x6280;&#x672F;&#x521B;&#x4E1A;&#x516C;&#x53F8;&#x5728;&#x4E2D;&#x56FD;&#x6B63;&#x5728;&#x53D1;&#x5C55;&#xFF0C;Tengine&#xFF0C;openresty&#x662F;&#x5F88;&#x597D;&#x4F8B;&#x5B50;&#xFF0C;&#x4E2D;&#x7F8E;&#x8131;&#x94A9;&#x7684;&#x8D8B;&#x52BF;&#x7ED9;&#x4E2D;&#x56FD;&#x53D1;&#x5C55;&#x81EA;&#x5DF1;&#x6280;&#x672F;&#x6808;&#x63D0;&#x4F9B;&#x4E86;&#x5DE8;&#x5927;&#x7684;&#x673A;&#x9047;&#x3002;</p>
<p>&#x3010;&#x738B;&#x5174;&#x5B87;&#x70B9;&#x8BC4;&#x3011;&#x4ECE;&#x6211;&#x4EEC;&#x89C2;&#x5BDF;&#x5230;&#x7684;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x60C5;&#x51B5;&#x770B;&#xFF0C;&#x786E;&#x5B9E;&#x5F88;&#x591A;&#x4EBA;&#x80FD;&#x591F;&#x65E0;&#x62A5;&#x916C;&#x5730;&#x53C2;&#x4E0E;&#xFF08;&#x6216;&#x5C1D;&#x8BD5;&#xFF09;&#x4E00;&#x6B21;&#x4E24;&#x6B21;&#x7684;&#x5F00;&#x6E90;&#x8D21;&#x732E;&#xFF0C;&#x4F46;&#x662F;&#x80FD;&#x6301;&#x4E45;&#x6301;&#x7EED;&#x5730;&#x5728;&#x65E0;&#x62A5;&#x916C;&#x7684;&#x72B6;&#x51B5;&#x4E0B;&#x53C2;&#x4E0E;&#x7684;&#x8D21;&#x732E;&#x8005;&#x5448;&#x957F;&#x5C3E;&#x5206;&#x5E03;&#xFF0C;&#x6570;&#x91CF;&#x6781;&#x5C11;&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x5E0C;&#x671B;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x3001;&#x5F00;&#x6E90;&#x7EC4;&#x7EC7;&#x5F62;&#x6001;&#x4E2D;&#x63A2;&#x8BA8;&#x5408;&#x9002;&#x7684;&#x8D21;&#x732E;&#x5EA6;&#x6D4B;&#x91CF;&#x53CA;&#x56DE;&#x9988;&#xFF0C;&#x5E2E;&#x52A9;&#x66F4;&#x591A;&#x7684;&#x5F00;&#x6E90;&#x8D21;&#x732E;&#x8005;&#x4E00;&#x4E2A;&#x4F9D;&#x8D56;&#x4E8E;&#x5F00;&#x6E90;&#x5B58;&#x6D3B;&#x548C;&#x751F;&#x957F;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x8BA8;&#x8BBA;&#x548C;&#x77E5;&#x8BC6;&#xFF0C;&#x90FD;&#x662F;&#x56FD;&#x5185;&#x5341;&#x5206;&#x7F3A;&#x4E4F;&#x7684;&#x3002;</p>
<h3 id="46-&#x8FDC;&#x7A0B;&#x529E;&#x516C;">4.6 &#x8FDC;&#x7A0B;&#x529E;&#x516C;</h3>
<p>&#x8FDC;&#x7A0B;&#x529E;&#x516C;&#x662F;&#x91CD;&#x8981;&#x7684;&#x529E;&#x516C;&#x65B9;&#x5F0F;&#x3002;&#x8D85;&#x8FC7;&#x4E5D;&#x6210;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x8BA4;&#x4E3A;&#x8FDC;&#x7A0B;&#x529E;&#x516C;&#x662F;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x4E14;&#x5C06;&#x8FD1;&#x4E5D;&#x6210;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x6709;&#x8FC7;&#x8FDC;&#x7A0B;&#x529E;&#x516C;&#x7ECF;&#x5386;&#xFF0C;&#x4ECE;&#x672A;&#x8FDB;&#x884C;&#x8FDC;&#x7A0B;&#x529E;&#x516C;&#x7684;&#x4EC5;&#x5360;&#x4E00;&#x6210;&#x3002;</p>
<p><img src="images/1-investigation-12.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;618</p>
<hr>
<p>&#x3010;&#x5835;&#x4FCA;&#x5E73;&#x70B9;&#x8BC4;&#x3011;&#x4E00;&#x4E2A;&#x5408;&#x683C;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x5FC5;&#x987B;&#x8981;&#x5B66;&#x4F1A;&#x4E0E;&#x4EBA;&#x4EA4;&#x6D41;&#x4E0E;&#x5408;&#x4F5C;&#x3002;&#x800C;&#x5BF9;&#x4E8E;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x800C;&#x8A00;&#xFF0C;&#x7531;&#x4E8E;&#x5F00;&#x53D1;&#x8005;&#x5929;&#x7136;&#x5206;&#x5E03;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5730;&#x57DF;&#x751A;&#x81F3;&#x56FD;&#x5EA6;&#xFF0C;&#x4E0E;&#x5176;&#x4ED6;&#x5F00;&#x53D1;&#x8005;&#x662F;&#x5426;&#x80FD;&#x8FDC;&#x7A0B;&#x534F;&#x4F5C;&#x5C31;&#x662F;&#x8003;&#x9A8C;&#x4E00;&#x4E2A;&#x5F00;&#x6E90;&#x8D21;&#x732E;&#x8005;&#x662F;&#x5426;&#x5408;&#x683C;&#x7684;&#x91CD;&#x8981;&#x6807;&#x5FD7;&#x4E4B;&#x4E00;&#x3002;&#x901A;&#x8FC7;&#x501F;&#x52A9;&#x5728;&#x7EBF;&#x7684;&#x9879;&#x76EE;&#x7BA1;&#x7406;&#x4E0E;&#x6C9F;&#x901A;&#x5DE5;&#x5177;&#xFF0C;&#x5B9A;&#x671F;&#x7684;&#x7EBF;&#x4E0A;&#x4F1A;&#x8BAE;&#xFF0C;&#x4EE5;&#x53CA;&#x4E0D;&#x5B9A;&#x671F;&#x7684;&#x7EBF;&#x4E0B;&#x6280;&#x672F;&#x4EA4;&#x6D41;&#xFF0C;&#x5F00;&#x6E90;&#x8D21;&#x732E;&#x8005;&#x9700;&#x8981;&#x4E3B;&#x52A8;&#x4E0E;&#x793E;&#x533A;&#x6C9F;&#x901A;&#x4EA4;&#x6D41;&#xFF0C;&#x8FBE;&#x6210;&#x4E00;&#x81F4;&#xFF0C;&#x5F88;&#x591A;&#x9879;&#x76EE;&#x751A;&#x81F3;&#x4F1A;&#x6D89;&#x53CA;&#x5230;&#x8DE8;&#x56FD;&#x6C9F;&#x901A;&#x3002;&#x6240;&#x4EE5;&#x8981;&#x60F3;&#x6709;&#x6548;&#x7684;&#x53C2;&#x4E0E;&#x5230;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x4E2D;&#x6765;&#xFF0C;&#x5F00;&#x53D1;&#x8005;&#x9700;&#x8981;&#x63D0;&#x9AD8;&#x81EA;&#x5DF1;&#x7684;&#x6C9F;&#x901A;&#x80FD;&#x529B;&#x4E0E;&#x6280;&#x5DE7;&#xFF0C;&#x5305;&#x62EC;&#x5728;&#x548C;&#x5176;&#x4ED6;&#x5F00;&#x53D1;&#x8005;&#x610F;&#x89C1;&#x76F8;&#x5DE6;&#x7684;&#x65F6;&#x5019;&#x5982;&#x4F55;&#x5F62;&#x6210;&#x5171;&#x8BC6;&#x3001;&#x8FBE;&#x6210;&#x4E00;&#x81F4;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E2D;&#x56FD;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x5F00;&#x53D1;&#x8005;&#x800C;&#x8A00;&#xFF0C;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x7684;&#x8981;&#x6C42;&#x662F;&#x8981;&#x63D0;&#x9AD8;&#x81EA;&#x5DF1;&#x7684;&#x82F1;&#x6587;&#x80FD;&#x529B;&#xFF0C;&#x56E0;&#x4E3A;&#x5F53;&#x524D;&#x7684;&#x73B0;&#x72B6;&#x662F;&#x5927;&#x591A;&#x6570;&#x6BD4;&#x8F83;&#x6D41;&#x884C;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#xFF0C;&#x5176;&#x80CC;&#x540E;&#x7684;&#x793E;&#x533A;&#x662F;&#x4EE5;&#x82F1;&#x8BED;&#x4E3A;&#x5DE5;&#x4F5C;&#x8BED;&#x8A00;&#x6765;&#x53C2;&#x4E0E;&#x8D21;&#x732E;&#x7684;&#x3002;</p>
<p>&#x3010;&#x4E25;&#x5251;&#x5CF0;&#x70B9;&#x8BC4;&#x3011;: &#x671F;&#x5F85;&#x4ECA;&#x540E;&#x80FD;&#x591F;&#x770B;&#x5230;&#x66F4;&#x591A;&#x7684;&#x4E2D;&#x56FD;&#x672C;&#x571F;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x5B75;&#x5316;&#x51FA;&#x6765;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x3002;&#x76EE;&#x524D;&#x66F4;&#x591A;&#x7684;&#x8FD8;&#x662F;&#x5927;&#x5382;&#x4E3B;&#x5BFC;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#xFF0C;&#x5927;&#x4F17;&#x53C2;&#x4E0E;&#x5EA6;&#x8FD8;&#x6709;&#x5F85;&#x63D0;&#x9AD8;&#x3002;&#x53C2;&#x4E0E;&#x56FD;&#x9645;&#x793E;&#x533A;&#x4E3B;&#x5BFC;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#xFF0C;&#x5BF9;&#x5F88;&#x591A;&#x56FD;&#x5185;&#x5F00;&#x53D1;&#x8005;&#x6765;&#x8BF4;&#x8FD8;&#x662F;&#x5B58;&#x5728;&#x8BED;&#x8A00;&#x548C;&#x6C9F;&#x901A;&#x7684;&#x969C;&#x788D;&#x3002;&#x6240;&#x4EE5;&#x65E9;&#x671F;&#x4E0D;&#x9700;&#x8981;&#x4E00;&#x5B9A;&#x548C;&#x56FD;&#x9645;&#x63A5;&#x8F68;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x5F88;&#x597D;&#x7684;&#x4E2D;&#x56FD;&#x793E;&#x533A;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#xFF0C;&#x5F00;&#x6E90;&#x6CBB;&#x7406;&#xFF0C;&#x4F1A;&#x57F9;&#x517B;&#x66F4;&#x591A;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#xFF0C;&#x8D21;&#x732E;&#x8005;&#xFF0C;&#x800C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x5F00;&#x6E90;&#x7684;&#x4F7F;&#x7528;&#x8005;&#xFF0C;&#x6D88;&#x8D39;&#x8005;&#x3002;&#x9700;&#x8981;&#x4E00;&#x6279;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x6210;&#x4E3A;&#x5F00;&#x6E90;&#x7684;&#x201C;&#x9EC4;&#x57D4;&#x519B;&#x6821;&#x201D;&#x3002;</p>
<p>&#x3010;&#x6ED5;&#x7231;&#x9F84;&#x70B9;&#x8BC4;&#x3011;&#x8FDC;&#x7A0B;&#x529E;&#x516C;&#x5BF9;&#x4EBA;&#x7684;&#x8981;&#x6C42;&#x662F;&#x66F4;&#x9AD8;&#x7684;&#xFF0C;&#x5F00;&#x6E90;&#x7684;&#x534F;&#x4F5C;&#x6A21;&#x5F0F;&#x53CA;&#x5404;&#x79CD;&#x5DE5;&#x5177;&#x63D0;&#x4F9B;&#x4E86;&#x4FBF;&#x5229;&#x7684;&#x8FDC;&#x7A0B;&#x529E;&#x516C;&#x6761;&#x4EF6;&#xFF0C;&#x534F;&#x4F5C;&#x7684;&#x80FD;&#x529B;&#x5219;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7684;&#x5B66;&#x4E60;&#x548C;&#x953B;&#x70BC;&#xFF0C;&#x591A;&#x53C2;&#x4E0E;&#x793E;&#x533A;&#x6CBB;&#x7406;&#x80FD;&#x529B;&#x9AD8;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x5B66;&#x4E60;&#x8DEF;&#x5F84;&#x3002;</p>
<h3 id="47-&#x7B2C;&#x4E00;&#x6B21;&#x63A5;&#x89E6;&#x7684;&#x5F00;&#x6E90;&#x4EA7;&#x54C1;">4.7 &#x7B2C;&#x4E00;&#x6B21;&#x63A5;&#x89E6;&#x7684;&#x5F00;&#x6E90;&#x4EA7;&#x54C1;</h3>
<p>&#x6709;&#x5C06;&#x8FD1;&#x56DB;&#x6210;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x7B2C;&#x4E00;&#x6B21;&#x63A5;&#x89E6;&#x7684;&#x5F00;&#x6E90;&#x4EA7;&#x54C1;&#x4E3A;&#x4E92;&#x8054;&#x7F51;&#x4EA7;&#x54C1;&#xFF0C;&#x7D27;&#x968F;&#x5176;&#x540E;&#x7684;&#x4FBF;&#x662F;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x76F8;&#x5173;&#x7684;&#x4EA7;&#x54C1;&#x4E0E;&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#x3002;&#x7ED3;&#x679C;&#x4E0E;2018&#x5E74;&#x7684;&#x8C03;&#x67E5;&#x7ED3;&#x679C;&#x57FA;&#x672C;&#x4E00;&#x81F4;&#xFF0C;&#x8BF4;&#x660E;&#x4E92;&#x8054;&#x7F51;&#x4EA7;&#x54C1;&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x76F8;&#x5173;&#x4EA7;&#x54C1;&#x4ECD;&#x662F;&#x5927;&#x5BB6;&#x63A5;&#x89E6;&#x548C;&#x4E86;&#x89E3;&#x5F00;&#x6E90;&#x7684;&#x6700;&#x521D;&#x7A97;&#x53E3;&#x3002; </p>
<p><img src="images/1-investigation-13.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;618</p>
<h3 id="48-&#x6700;&#x5E0C;&#x671B;&#x5F00;&#x6E90;&#x7684;&#x4EA7;&#x54C1;">4.8 &#x6700;&#x5E0C;&#x671B;&#x5F00;&#x6E90;&#x7684;&#x4EA7;&#x54C1;</h3>
<p>&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x548C;&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#x4F5C;&#x4E3A;&#x76F8;&#x5BF9;&#x590D;&#x6742;&#x800C;&#x5168;&#x9762;&#x7684;&#x6280;&#x672F;&#x4EA7;&#x54C1;&#xFF0C;&#x6210;&#x4E3A;&#x5927;&#x5BB6;&#x6700;&#x5E0C;&#x671B;&#x5F00;&#x6E90;&#x7684;&#x4EA7;&#x54C1;&#x3002;</p>
<p><img src="images/1-investigation-14.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;618</p>
<hr>
<p>&#x3010;&#x5835;&#x4FCA;&#x5E73;&#x70B9;&#x8BC4;&#x3011;&#x8FD9;&#x8BF4;&#x660E;&#x8D8A;&#x662F;&#x5E95;&#x5C42;&#x7684;&#x57FA;&#x7840;&#x8F6F;&#x4EF6;&#xFF0C;&#x8D8A;&#x80FD;&#x52FE;&#x5F15;&#x8D77;&#x5F00;&#x53D1;&#x8005;&#x901A;&#x8FC7;&#x4EE3;&#x7801;&#x53BB;&#x63A2;&#x7A76;&#x6280;&#x672F;&#x7EC6;&#x8282;&#x7684;&#x5174;&#x8DA3;&#x3002;&#x5F53;&#x7136;&#x76F8;&#x6BD4;&#x4E8E;&#x4E30;&#x5BCC;&#x7684;&#x4E0A;&#x5C42;&#x5E94;&#x7528;&#x578B;&#x8F6F;&#x4EF6;&#xFF0C;&#x6280;&#x672F;&#x5E95;&#x5EA7;&#x578B;&#x8F6F;&#x4EF6;&#x7684;&#x901A;&#x7528;&#x6027;&#x4E5F;&#x66F4;&#x597D;&#x3002;</p>
<h2 id="&#x4E94;&#x3001;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x53C2;&#x4E0E;&#x73B0;&#x72B6;">&#x4E94;&#x3001;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x53C2;&#x4E0E;&#x73B0;&#x72B6;</h2>
<h3 id="51-&#x5F00;&#x6E90;&#x6700;&#x5438;&#x5F15;&#x4F60;&#x7684;&#x56E0;&#x7D20;">5.1 &#x5F00;&#x6E90;&#x6700;&#x5438;&#x5F15;&#x4F60;&#x7684;&#x56E0;&#x7D20;</h3>
<p>&#x5F00;&#x653E;&#x900F;&#x660E;&#x7684;&#x4EE3;&#x7801;&#x548C;&#x77E5;&#x8BC6;&#x5171;&#x4EAB;&#xFF0C;&#x4EE5;&#x53CA;&#x5F00;&#x6E90;&#x7684;&#x7CBE;&#x795E;&#x7406;&#x5FF5;&#x6210;&#x4E3A;&#x5F00;&#x6E90;&#x6700;&#x5438;&#x5F15;&#x53C2;&#x4E0E;&#x8005;&#x7684;&#x56E0;&#x7D20;&#xFF0C;&#x800C;&#x8F6F;&#x4EF6;&#x7684;&#x8D2D;&#x4E70;&#x6210;&#x672C;&#x5374;&#x5E76;&#x4E0D;&#x662F;&#x4E3B;&#x8981;&#x7684;&#x56E0;&#x7D20;&#x3002;</p>
<p><img src="images/1-investigation-15.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;618</p>
<hr>
<p>&#x3010;&#x4E25;&#x5251;&#x5CF0;&#x70B9;&#x8BC4;&#x3011;: &#x5E0C;&#x671B;&#x672A;&#x6765;&#x7684;&#x9009;&#x9879;&#x53EF;&#x4EE5;&#x589E;&#x52A0;&#x7C7B;&#x4F3C;&#x201C;&#x901A;&#x8FC7;&#x6211;&#x7684;&#x8D21;&#x732E;&#xFF0C;&#x6765;&#x5C0F;&#x5C0F;&#x6539;&#x53D8;&#x884C;&#x4E1A;&#x751A;&#x81F3;&#x6539;&#x53D8;&#x4E16;&#x754C;&#x201D;&#x7684;&#x6210;&#x5C31;&#x611F;&#x4E4B;&#x7C7B;&#x7684;&#x9009;&#x9879;&#x3002;&#x6210;&#x5C31;&#x611F;&#x662F;&#x5F88;&#x591A;&#x56FD;&#x9645;&#x5F00;&#x6E90;&#x6DF1;&#x5EA6;&#x53C2;&#x4E0E;&#x8005;&#x7684;&#x91CD;&#x8981;&#x56E0;&#x7D20;&#x4E4B;&#x4E00;&#x3002;</p>
<p>&#x3010;&#x7EA2;&#x85AF;&#x70B9;&#x8BC4;&#x3011;&#x5F00;&#x53D1;&#x8005;&#x5BF9;&#x5F00;&#x6E90;&#x7684;&#x8BA4;&#x77E5;&#x5728;&#x4E0D;&#x65AD;&#x6F14;&#x8FDB;&#xFF0C;&#x7ECF;&#x5386;&#x7740;&#x4ECE;&#x300C;&#x4E86;&#x89E3;-&#x8BA4;&#x540C;-&#x53C2;&#x4E0E;&#x300D;&#x7684;&#x8F6C;&#x53D8;&#x3002;&#x5728;&#x73B0;&#x9636;&#x6BB5;&#xFF0C;&#x4E0D;&#x5C11;&#x5F00;&#x53D1;&#x8005;&#x5BF9;&#x4E8E;&#x300C;&#x53C2;&#x4E0E;&#x300D;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x8DDD;&#x79BB;&#x611F;&#x3002;&#x8BA9;&#x66F4;&#x591A;&#x5F00;&#x53D1;&#x8005;&#x4E86;&#x89E3;&#x53EF;&#x4EE5;&#x5982;&#x4F55;&#x53C2;&#x4E0E;&#x5F00;&#x6E90;&#xFF0C;&#x4E5F;&#x662F;&#x6211;&#x4EEC;&#x63A5;&#x4E0B;&#x6765;&#x9700;&#x8981;&#x53BB;&#x52AA;&#x529B;&#x7684;&#x65B9;&#x5411;&#x3002;</p>
<h2 id="52-&#x6700;&#x559C;&#x6B22;&#x7684;&#x5F00;&#x6E90;&#x4EA7;&#x54C1;&#x662F;&#x4EC0;&#x4E48;">5.2 &#x6700;&#x559C;&#x6B22;&#x7684;&#x5F00;&#x6E90;&#x4EA7;&#x54C1;&#x662F;&#x4EC0;&#x4E48;</h2>
<p>Linux&#x4EE5;&#x5DE8;&#x5927;&#x4F18;&#x52BF;&#xFF0C;&#x6210;&#x4E3A;&#x53C2;&#x4E0E;&#x8005;&#x6700;&#x559C;&#x7231;&#x7684;&#x5F00;&#x6E90;&#x4EA7;&#x54C1;&#xFF0C;Apache&#x4ECA;&#x5E74;&#x6765;&#x5728;&#x4E2D;&#x56FD;&#x53D1;&#x5C55;&#x5DF2;&#x6709;&#x71CE;&#x539F;&#x4E4B;&#x52BF;&#xFF0C;&#x5BB9;&#x5668;&#x754C;&#x7684;&#x9ED1;&#x9A6C; Docker &#x7D27;&#x968F;&#x5176;&#x540E;&#xFF0C;Mysql&#x3001;Chromium&#x51ED;&#x501F;&#x5728;&#x5404;&#x81EA;&#x9886;&#x57DF;&#x7684;&#x91CD;&#x8981;&#x5730;&#x4F4D;&#xFF0C;&#x6392;&#x8FDB;&#x524D;&#x4E94;&#x540D;&#x3002;</p>
<p><img src="images/1-investigation-16.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;618</p>
<hr>
<p>&#x3010;&#x5835;&#x4FCA;&#x5E73;&#x70B9;&#x8BC4;&#x3011;Linux&#x4F5C;&#x4E3A;&#x5F88;&#x591A;&#x5F00;&#x53D1;&#x8005;&#x65E5;&#x5E38;&#x5DE5;&#x4F5C;&#x7684;&#x5E73;&#x53F0;&#xFF08;&#x5C24;&#x5176;&#x662F;&#x540E;&#x7AEF;&#x7A0B;&#x5E8F;&#x5458;&#xFF09;&#xFF0C;&#x6DF1;&#x53D7;&#x5E7F;&#x5927;&#x5F00;&#x53D1;&#x8005;&#x559C;&#x7231;&#x5E76;&#x4E0D;&#x610F;&#x5916;&#x3002;&#x5728;&#x4E91;&#x539F;&#x751F;&#x4E0E;&#x5BB9;&#x5668;&#x5316;&#x7684;&#x65F6;&#x4EE3;&#xFF0C;Docker&#x53D7;&#x5230;&#x5E7F;&#x6CDB;&#x6B22;&#x8FCE;&#x4E5F;&#x5C5E;&#x610F;&#x6599;&#x4E4B;&#x4E2D;&#xFF0C;&#x4E0D;&#x8FC7;Kubernetes&#x7684;&#x7F3A;&#x5931;&#x662F;&#x5426;&#x8BF4;&#x660E;&#x4F01;&#x4E1A;&#x7EA7;&#x7684;&#x4E91;&#x539F;&#x751F;&#x670D;&#x52A1;&#x7684;&#x6613;&#x7528;&#x6027;&#x548C;&#x7A33;&#x5B9A;&#x6027;&#x5C1A;&#x5904;&#x4E8E;&#x89C2;&#x5BDF;&#x671F;&#xFF1F;&#x53E6;&#x5916;&#x4E00;&#x4E9B;&#x5927;&#x6570;&#x636E;&#x4E0E;AI&#x9886;&#x57DF;&#x70ED;&#x95E8;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;Hadoop, Spark, TensorFlow&#x672A;&#x5217;&#x5176;&#x4E2D;&#xFF0C;&#x7A0D;&#x663E;&#x610F;&#x5916;&#xFF0C;&#x53EF;&#x80FD;&#x4E0E;&#x8FD9;&#x4E24;&#x4E2A;&#x9886;&#x57DF;&#x7684;&#x884C;&#x4E1A;&#x58C1;&#x5792;&#x8F83;&#x9AD8;&#x6709;&#x5173;&#x3002;</p>
<p>&#x3010;&#x738B;&#x5174;&#x5B87;&#x70B9;&#x8BC4;&#x3011;&#x6211;&#x8BA4;&#x4E3A;&#x5927;&#x5BB6;&#x559C;&#x6B22;&#x201C;Linux&#x201D;&#x66F4;&#x591A;&#x7684;&#x662F;&#x559C;&#x6B22;&#x4EE5; Linux &#x4E3A;&#x4EE3;&#x8868;&#x3001;&#x4EE5;&#x4E4B;&#x4E3A;&#x57FA;&#x7840;&#x800C;&#x6784;&#x5EFA;&#x51FA;&#x6765;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x548C;&#x5F00;&#x6E90;&#x4E16;&#x754C;&#x3002;</p>
<h2 id="53-&#x5177;&#x4F53;&#x53C2;&#x4E0E;&#x7684;&#x793E;&#x533A;&#x5DE5;&#x4F5C;">5.3 &#x5177;&#x4F53;&#x53C2;&#x4E0E;&#x7684;&#x793E;&#x533A;&#x5DE5;&#x4F5C;</h2>
<p>&#x6709;6&#x6210;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x5728;&#x793E;&#x533A;&#x5747;&#x53C2;&#x4E0E;&#x4EE3;&#x7801;&#x8D21;&#x732E;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x800C;&#x6587;&#x6863;&#x4E0E;&#x6D4B;&#x8BD5;&#x5DE5;&#x4F5C;&#x4E5F;&#x5360;&#x6709;&#x5F88;&#x5927;&#x7684;&#x6BD4;&#x4F8B;&#x3002;&#x6D3B;&#x52A8;&#x7EC4;&#x7EC7;&#x548C;&#x793E;&#x533A;&#x7ECF;&#x7406;&#x7684;&#x6BD4;&#x4F8B;&#x5360;&#x5230;2&#x6210;&#xFF0C;&#x8BF4;&#x660E;&#x793E;&#x533A;&#x7684;&#x6D3B;&#x52A8;&#x8FD8;&#x662F;&#x975E;&#x5E38;&#x5FC5;&#x4E0D;&#x53EF;&#x5C11;&#x7684;&#x3002; </p>
<p><img src="images/1-investigation-17.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;472</p>
<hr>
<p>&#x3010;&#x6ED5;&#x7231;&#x9F84;&#x70B9;&#x8BC4;&#x3011;&#x4EE3;&#x7801;&#x5728;&#x793E;&#x533A;&#x4E2D;&#x7684;&#x786E;&#x662F;&#x66F4;&#x6613;&#x53D7;&#x8BA4;&#x53EF;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x4F18;&#x79C0;&#x7684;&#x6587;&#x6863;&#x3001;&#x5B8C;&#x5584;&#x7684;&#x6D4B;&#x8BD5;&#x7528;&#x4F8B;&#xFF0C;&#x5BF9;&#x4E00;&#x6B3E;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x7684;&#x53CB;&#x597D;&#x5EA6;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x4ECE;&#x8FD9;&#x90E8;&#x5206;&#x5DE5;&#x4F5C;&#x5165;&#x624B;&#x4E5F;&#x662F;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x4E00;&#x4E2A;&#x8D77;&#x70B9;&#x3002;</p>
<h3 id="54-&#x6700;&#x770B;&#x597D;&#x7684;&#x5F00;&#x6E90;&#x4EA7;&#x54C1;">5.4 &#x6700;&#x770B;&#x597D;&#x7684;&#x5F00;&#x6E90;&#x4EA7;&#x54C1;</h3>
<p>&#x5F00;&#x6E90;&#x4EA7;&#x54C1;&#x7684;&#x524D;&#x666F;&#x5C55;&#x671B;&#x4E2D;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x4EA7;&#x54C1;&#x4EE5;&#x8FD1;40%&#x7684;&#x6BD4;&#x4F8B;&#x6210;&#x4E3A;&#x53C2;&#x4E0E;&#x8005;&#x6700;&#x770B;&#x597D;&#x7684;&#x5F00;&#x6E90;&#x4EA7;&#x54C1;&#x53D1;&#x5C55;&#x65B9;&#x5411;&#x3002;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x548C;&#x5BB9;&#x5668;&#x5316;&#x5F02;&#x519B;&#x7A81;&#x8D77;&#xFF0C; &#x6210;&#x4E3A;&#x73B0;&#x5728;&#x5F00;&#x6E90;&#x4EA7;&#x54C1;&#x4E2D;&#x7684;&#x98CE;&#x53E3;&#x548C;&#x70ED;&#x70B9;&#x3002; </p>
<p><img src="images/1-investigation-18.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;618</p>
<hr>
<h3 id="55-&#x5F00;&#x6E90;&#x793E;&#x533A;&#x7684;&#x4EA4;&#x6D41;&#x65B9;&#x5F0F;">5.5 &#x5F00;&#x6E90;&#x793E;&#x533A;&#x7684;&#x4EA4;&#x6D41;&#x65B9;&#x5F0F;</h3>
<p>&#x5728;&#x793E;&#x533A;&#x7684;&#x4EA4;&#x6D41;&#x65B9;&#x5F0F;&#x4E2D;&#xFF0C;&#x90AE;&#x4EF6;&#x5217;&#x8868;&#x4F9D;&#x7136;&#x662F;&#x6700;&#x4E3A;&#x666E;&#x904D;&#x7684;&#xFF0C;&#x800C;&#x5FAE;&#x4FE1;&#x548C; QQ &#x4E5F;&#x662F;&#x56FD;&#x5185;&#x91CD;&#x8981;&#x7684;&#x5373;&#x65F6;&#x4EA4;&#x6D41;&#x5DE5;&#x5177;&#x3002;&#x65B0;&#x9510;&#x7684;&#x4EA4;&#x6D41;&#x5DE5;&#x5177;&#x6BD4;&#x4F8B;&#x4E0A;&#x5347;&#xFF1A;Slack &#x548C; Zoom &#x4E5F;&#x662F;&#x503C;&#x5F97;&#x5173;&#x6CE8;&#x7684;&#x73B0;&#x8C61;&#x3002; </p>
<p><img src="images/1-investigation-19.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;472</p>
<hr>
<h3 id="56-&#x793E;&#x533A;&#x4E0E;&#x4EE3;&#x7801;&#x7684;&#x5173;&#x7CFB;">5.6 &#x793E;&#x533A;&#x4E0E;&#x4EE3;&#x7801;&#x7684;&#x5173;&#x7CFB;</h3>
<p>&#x6709;&#x8FD1;&#x516B;&#x6210;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x8BA4;&#x4E3A;&#x5728;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x4E2D;&#xFF0C;&#x793E;&#x533A;&#x7684;&#x4EF7;&#x503C;&#x5927;&#x4E8E;&#x6216;&#x7B49;&#x540C;&#x4E8E;&#x4EE3;&#x7801;&#xFF0C;&#x56E0;&#x4E3A;&#x56F4;&#x7ED5;&#x4EE3;&#x7801;&#x800C;&#x751F;&#x7684;&#x793E;&#x533A;&#xFF0C; &#x4F1A;&#x8BA9;&#x4EE3;&#x7801;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x4F18;&#x79C0;&#x3002; </p>
<p><img src="images/1-investigation-20.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;618</p>
<hr>
<p>&#x3010;&#x5835;&#x4FCA;&#x5E73;&#x70B9;&#x8BC4;&#x3011;&#x63A5;&#x8FD1;&#x534A;&#x6570;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x8BA4;&#x4E3A;&#x793E;&#x533A;&#x4F18;&#x5148;&#x4E8E;&#x4EE3;&#x7801;&#x672C;&#x8EAB;&#xFF0C;&#x8FD9;&#x8BF4;&#x660E;&#x4E2D;&#x56FD;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x5728;&#x5BF9;&#x5F85;&#x5F00;&#x6E90;&#x7684;&#x95EE;&#x9898;&#x4E0A;&#xFF0C;&#x89C2;&#x70B9;&#x8D8A;&#x6765;&#x8D8A;&#x6210;&#x719F;&#x4E0E;&#x7406;&#x6027;&#x3002;&#x968F;&#x7740;&#x6301;&#x8FD9;&#x6837;&#x89C2;&#x70B9;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x4EBA;&#x7FA4;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x53EF;&#x4EE5;&#x671F;&#x5F85;&#x7684;&#x662F;&#xFF0C;&#x7531;&#x4E2D;&#x56FD;&#x53D1;&#x8D77;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x91CD;&#x89C6;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x7684;&#x6784;&#x5EFA;&#xFF0C;&#x793E;&#x533A;&#x6C1B;&#x56F4;&#x4E5F;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x5F00;&#x653E;&#x4E0E;&#x5E73;&#x7B49;&#x3002;&#x800C;&#x5065;&#x5EB7;&#x7684;&#x793E;&#x533A;&#x6C1B;&#x56F4;&#x4E5F;&#x4F1A;&#x66F4;&#x6709;&#x5229;&#x4E8E;&#x5E7F;&#x5927;&#x5F00;&#x53D1;&#x8005;&#x4EE5;&#x9879;&#x76EE;&#x4E3A;&#x4F9D;&#x6258;&#xFF0C;&#x8FDB;&#x884C;&#x6709;&#x6548;&#x7684;&#x6280;&#x672F;&#x521B;&#x65B0;&#x4E0E;&#x5408;&#x4F5C;&#x3002;</p>
<p>&#x3010;&#x6ED5;&#x7231;&#x9F84;&#x70B9;&#x8BC4;&#x3011;&#x793E;&#x533A;&#x548C;&#x4EE3;&#x7801;&#x7684;&#x5173;&#x7CFB;&#x4E0D;&#x5E94;&#x8BE5;&#x5272;&#x88C2;&#x5730;&#x8FDB;&#x884C;&#x8BA8;&#x8BBA;&#xFF0C;&#x793E;&#x533A;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x6839;&#x636E;&#x4E2A;&#x4EBA;&#x7231;&#x597D;&#x8FDB;&#x884C;&#x76F8;&#x5E94;&#x7684;&#x5DE5;&#x4F5C;&#x4FA7;&#x91CD;&#x662F;&#x8D21;&#x732E;&#x81EA;&#x7531;&#x3002;&#x4F46;&#x5BF9;&#x793E;&#x533A;&#x6838;&#x5FC3;&#x7EF4;&#x62A4;&#x8005;&#x6765;&#x8BF4;&#xFF0C;&#x5982;&#x4F55;&#x5E2E;&#x52A9;&#x793E;&#x533A;&#x5408;&#x9002;&#x7684;&#x4EBA;&#x53BB;&#x89E3;&#x51B3;&#x5408;&#x9002;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x7684;&#x786E;&#x503C;&#x5F97;&#x8BA8;&#x8BBA;&#x3002;</p>
<p>&#x3010;&#x738B;&#x5174;&#x5B87;&#x70B9;&#x8BC4;&#x3011;&#x5728;&#x5B9E;&#x9645;&#x7684;&#x8FD0;&#x8425;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x786E;&#x53D1;&#x73B0;&#xFF0C;&#x4EBA;&#x53EF;&#x80FD;&#x662F;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x6700;&#x91CD;&#x8981;&#x7684;&#x56E0;&#x7D20;&#x3002;&#x4EE3;&#x7801;&#x662F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x904D;&#x4E00;&#x904D;&#x7684;&#x4FEE;&#x6539;&#xFF0C;&#x4ECE;&#x65E0;&#x5230;&#x6709;&#x3001;&#x4ECE;&#x574F;&#x5230;&#x597D;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x793E;&#x533A;&#xFF0C;&#x4E00;&#x4E2A;&#x518D;&#x597D;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x6700;&#x7EC8;&#x8FD8;&#x662F;&#x4F1A;&#x8D70;&#x5411;&#x6D88;&#x4EA1;&#x3002;&#x800C;&#x8FD9;&#x4E00;&#x4E2A;&#xFF0C;&#x5BF9;&#x4E8E;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x8FD8;&#x662F;&#x95ED;&#x6E90;&#x8F6F;&#x4EF6;&#x90FD;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;</p>
<h3 id="57-&#x5F00;&#x6E90;&#x793E;&#x533A;&#x5E74;&#x9F84;&#x5206;&#x5E03;">5.7 &#x5F00;&#x6E90;&#x793E;&#x533A;&#x5E74;&#x9F84;&#x5206;&#x5E03;</h3>
<p>&#x5728;&#x53C2;&#x4E0E;&#x8005;&#x8EAB;&#x8FB9;&#x7684;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x6210;&#x5458;&#x4E2D;&#xFF0C;20-30&#x5C81;&#x7684;&#x8D21;&#x732E;&#x8005;&#x662F;&#x4E3B;&#x8981;&#x7684;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF0C;&#x5360;&#x6BD4;&#x8D85;&#x8FC7;&#x516D;&#x6210;&#x3002;</p>
<p><img src="images/1-investigation-21.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;472</p>
<hr>
<h3 id="58-&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x548C;&#x81EA;&#x7531;&#x8F6F;&#x4EF6;&#x7CBE;&#x795E;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x8054;">5.8 &#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x548C;&#x81EA;&#x7531;&#x8F6F;&#x4EF6;&#x7CBE;&#x795E;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x8054;</h3>
<p>&#x8D85;&#x8FC7;&#x534A;&#x6570;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x8BA4;&#x4E3A;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x548C;&#x81EA;&#x7531;&#x8F6F;&#x4EF6;&#x7CBE;&#x795E;&#x4E4B;&#x95F4;&#x6709;&#x7D27;&#x5BC6;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x90FD;&#x5F3A;&#x8C03;&#x77E5;&#x8BC6;&#x5171;&#x4EAB;&#xFF0C;&#x6781;&#x5C11;&#x6570;&#x53C2;&#x4E0E;&#x8005;&#x8BA4;&#x4E3A;&#x4E8C;&#x8005;&#x65E0;&#x5173;&#x3002;</p>
<p><img src="images/1-investigation-22.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;618</p>
<hr>
<h3 id="59-&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x5B89;&#x5168;">5.9 &#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x5B89;&#x5168;</h3>
<p>&#x8D85;&#x8FC7;&#x534A;&#x6570;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x4E0D;&#x4F1A;&#x5B58;&#x5728;&#x4E0D;&#x5B89;&#x5168;&#x611F;&#xFF0C;&#x4F46;&#x4ECD;&#x6709;&#x4E09;&#x5206;&#x4E4B;&#x4E00;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x4F1A;&#x5B58;&#x5728;&#x4E0D;&#x5B89;&#x5168;&#x611F;&#xFF0C;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x7684;&#x5B89;&#x5168;&#x95EE;&#x9898;&#x4ECD;&#x503C;&#x5F97;&#x5173;&#x6CE8;&#x3002;</p>
<p><img src="images/1-investigation-23.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;618</p>
<hr>
<h3 id="510-&#x4E2D;&#x56FD;&#x6210;&#x7ACB;&#x5F00;&#x6E90;&#x57FA;&#x91D1;&#x4F1A;&#x7684;&#x4F5C;&#x7528;">5.10 &#x4E2D;&#x56FD;&#x6210;&#x7ACB;&#x5F00;&#x6E90;&#x57FA;&#x91D1;&#x4F1A;&#x7684;&#x4F5C;&#x7528;</h3>
<p>&#x8D85;&#x8FC7;&#x4E09;&#x5206;&#x4E4B;&#x4E00;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x8BA4;&#x4E3A;&#x4E2D;&#x56FD;&#x6210;&#x7ACB;&#x5F00;&#x6E90;&#x57FA;&#x91D1;&#x4F1A;&#x53EF;&#x4EE5;&#x63A8;&#x5E7F;&#x5F00;&#x6E90;&#x7684;&#x7406;&#x5FF5;&#xFF0C;&#x5F00;&#x6E90;&#x6587;&#x5316;&#x6559;&#x80B2;&#xFF0C;&#x793E;&#x533A;&#x5EFA;&#x8BBE;&#xFF0C;&#x5EFA;&#x7ACB;&#x5F00;&#x6E90;&#x751F;&#x6001;&#x4F53;&#x7CFB;&#x3002;</p>
<p><img src="images/1-investigation-24.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;618</p>
<hr>
<p>&#x3010;&#x4E25;&#x5251;&#x5CF0;&#x70B9;&#x8BC4;&#x3011;: &#x5E0C;&#x671B;&#x51FA;&#x73B0;&#x4E2D;&#x56FD;&#x7684;&#x5F00;&#x6E90;&#x9EC4;&#x57D4;&#x519B;&#x6821;&#xFF01;</p>
<h3 id="511-&#x5F00;&#x6E90;&#x793E;&#x533A;&#x80A9;&#x8D1F;&#x7684;&#x4F7F;&#x547D;&#x4E0E;&#x89D2;&#x8272;&#x7684;&#x91CD;&#x8981;&#x7A0B;&#x5EA6;">5.11 &#x5F00;&#x6E90;&#x793E;&#x533A;&#x80A9;&#x8D1F;&#x7684;&#x4F7F;&#x547D;&#x4E0E;&#x89D2;&#x8272;&#x7684;&#x91CD;&#x8981;&#x7A0B;&#x5EA6;</h3>
<p>&#x5927;&#x591A;&#x6570;&#x53C2;&#x4E0E;&#x8005;&#x8BA4;&#x4E3A;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x80A9;&#x8D1F;&#x7740;&#x4FC3;&#x8FDB;&#x6210;&#x5458;&#x6280;&#x672F;&#x4EA4;&#x6D41;&#x3001;&#x53D1;&#x5C55;&#x793E;&#x533A;&#x6838;&#x5FC3;&#x9879;&#x76EE;&#x3001;&#x4F20;&#x64AD;&#x5F00;&#x6E90;&#x7406;&#x5FF5;&#x7684;&#x4F7F;&#x547D;&#x3002;</p>
<p><img src="images/1-investigation-25.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;618</p>
<p>&#x5F00;&#x53D1;&#x8005;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x793E;&#x533A;&#x4E2D;&#x6BD4;&#x8F83;&#x91CD;&#x8981;&#x89D2;&#x8272;&#xFF1A;&#x56DB;&#x6210;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x8BA4;&#x4E3A;&#x6838;&#x5FC3;&#x5F00;&#x53D1;&#x8005;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x793E;&#x533A;&#x7BA1;&#x7406;&#x4EBA;&#x5458;&#xFF0C;&#x5E03;&#x9053;&#x5E08;&#x548C;&#x793E;&#x533A;&#x6D3B;&#x52A8;&#x7EC4;&#x7EC7;&#x8005;&#x5360;&#x5230;&#x4E86;&#x8FD1;&#x4E09;&#x6210;&#x7684;&#x6BD4;&#x4F8B;&#x3002;&#x5F00;&#x53D1;&#x548C;&#x793E;&#x533A;&#x53D1;&#x5C55;&#xFF0C; &#x8FD9;&#x662F;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E24;&#x5927;&#x652F;&#x67F1;&#x3002;  </p>
<p><img src="images/1-investigation-26.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;615</p>
<h2 id="&#x516D;&#x3001;&#x5F00;&#x53D1;&#x8005;&#x6280;&#x672F;&#x73B0;&#x72B6;">&#x516D;&#x3001;&#x5F00;&#x53D1;&#x8005;&#x6280;&#x672F;&#x73B0;&#x72B6;</h2>
<h3 id="61-&#x4F7F;&#x7528;&#x8BED;&#x8A00;">6.1 &#x4F7F;&#x7528;&#x8BED;&#x8A00;</h3>
<p>&#x5F00;&#x53D1;&#x8BED;&#x8A00;&#x5448;&#x73B0;&#x591A;&#x8D85;&#x591A;&#x5F3A;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x524D;&#x4E09;&#x7532;&#x5206;&#x522B;&#x4E3A; JavaScript&#x3001;Java&#x3001;&#x548C;Python&#x3002;Go&#x8BED;&#x8A00;&#x8D85;&#x8FC7;C/C++&#xFF0C;&#x6392;&#x540D;&#x4ECE;&#x53BB;&#x5E74;&#x7684;&#x7B2C;&#x516B;&#x4E0A;&#x5347;&#x5230;&#x7B2C;&#x516D;&#xFF0C;&#x5BB9;&#x5668;&#x751F;&#x6001;&#x7684;&#x5FEB;&#x901F;&#x53D1;&#x5C55;&#x4E00;&#x65B9;&#x9762;&#x4E5F;&#x52A9;&#x63A8;&#x4E86;Go&#x8BED;&#x8A00;&#x7684;&#x53D1;&#x5C55;&#xFF0C;C/C++&#x4ECD;&#x5360;&#x8F83;&#x9AD8;&#x7684;&#x4F7F;&#x7528;&#x7387;&#x3002; </p>
<p><img src="images/1-investigation-27.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;299</p>
<hr>
<p>&#x3010;&#x738B;&#x5174;&#x5B87;&#x70B9;&#x8BC4;&#x3011;JavaScript &#x7684;&#x6392;&#x540D;&#x662F;&#x9884;&#x6599;&#x4E4B;&#x4E2D;&#x7684;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x811A;&#x672C;&#x8BED;&#x8A00;&#xFF0C;&#x5176;&#x5929;&#x7136;&#x5C31;&#x6BD4; Java &#x3001;Go&#x3001;C++ &#x7B49;&#x7F16;&#x8BD1;&#x578B;&#x8BED;&#x8A00;&#x66F4;&#x6709;&#x4F18;&#x52BF;&#xFF0C;&#x8BA9;&#x5F00;&#x53D1;&#x8005;&#x53EF;&#x4EE5;&#x66F4;&#x52A0;&#x7B80;&#x5355;&#x548C;&#x5BB9;&#x6613;&#x7684;&#x53C2;&#x4E0E;&#x5230;&#x9879;&#x76EE;&#x7684;&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x4E5F;&#x7B26;&#x5408;&#x5927;&#x5BB6;&#x5BF9;&#x4E8E;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x751F;&#x6001;&#x4E2D;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x7684;&#x8BA4;&#x77E5;</p>
<h3 id="62-&#x5728;&#x7EBF;&#x6587;&#x6863;&#x534F;&#x4F5C;&#x7F16;&#x8F91;&#x5DE5;&#x5177;">6.2 &#x5728;&#x7EBF;&#x6587;&#x6863;&#x534F;&#x4F5C;&#x7F16;&#x8F91;&#x5DE5;&#x5177;</h3>
<p>&#x5728;&#x7EBF;&#x6587;&#x6863;&#x7F16;&#x8F91;&#x5DE5;&#x5177;&#x4E2D;&#xFF0C;&#x6709;&#x8D85;&#x8FC7;&#x534A;&#x6570;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x5747;&#x4F7F;&#x7528;wiki&#x4F5C;&#x4E3A;&#x4ED6;&#x4EEC;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x800C;&#x5373;&#x4F7F;&#x5728;&#x7F51;&#x7EDC;&#x53D7;&#x9650;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;Google Doc&#x4E5F;&#x4F9D;&#x7136;&#x53D7;&#x5230;&#x5927;&#x5BB6;&#x7684;&#x9752;&#x7750;&#xFF1B;&#x5FAE;&#x8F6F;&#x7684;OneDrive&#x4E5F;&#x6709;20%&#x7684;&#x4F7F;&#x7528;&#x8005;&#x3002; &#x53E6;&#x5916;&#xFF0C;&#x77F3;&#x58A8;&#x6587;&#x6863;&#x7B49;&#x4E5F;&#x662F;&#x5728;&#x4E2D;&#x56FD;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x7684;&#x5DE5;&#x5177;&#x3002;</p>
<p><img src="images/1-investigation-28.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;472</p>
<h3 id="63-&#x7F16;&#x8F91;&#x5668;">6.3 &#x7F16;&#x8F91;&#x5668;</h3>
<p>&#x5728;&#x7F16;&#x8F91;&#x5668;&#x8BF7;&#x7528;&#x60C5;&#x51B5;&#x4E2D;&#xFF0C;&#x9ED1;&#x9A6C; VS Code&#x3001;vim&#x3001;notepad++ &#x4E00;&#x5982;&#x5373;&#x5F80;&#xFF0C;&#x5360;&#x636E;&#x7740;&#x524D;&#x4E09;&#x540D;&#xFF0C;&#x6DF1;&#x53D7;&#x5927;&#x5BB6;&#x559C;&#x7231;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5982; Sublime&#x3001;Atom.io&#x3001;emacs&#x7CFB;&#x5217;&#x7B49;&#x4E5F;&#x90FD;&#x662F;&#x5927;&#x5BB6;&#x5E38;&#x7528;&#x7684;&#x4EE3;&#x7801;&#x7F16;&#x8F91;&#x5668;&#x3002;</p>
<p><img src="images/1-investigation-29.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;299</p>
<h3 id="64-&#x7248;&#x672C;&#x63A7;&#x5236;&#x5DE5;&#x5177;">6.4 &#x7248;&#x672C;&#x63A7;&#x5236;&#x5DE5;&#x5177;</h3>
<p>&#x6BEB;&#x65E0;&#x7591;&#x95EE;&#x7684;&#x662F;&#xFF0C;Git&#x4E00;&#x679D;&#x72EC;&#x79C0;&#xFF0C;&#x5360;&#x636E;&#x7740;&#x5C06;&#x8FD1;&#x4E5D;&#x6210;&#x7684;&#x6BD4;&#x4F8B;&#x3002;SVN&#x3001;CVS&#x4ECD;&#x6709;&#x8FD1;&#x56DB;&#x6210;&#x7684;&#x4F7F;&#x7528;&#x6BD4;&#x4F8B;&#x3002;</p>
<p><img src="images/1-investigation-30.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;299</p>
<h3 id="65-&#x6570;&#x636E;&#x5E93;">6.5 &#x6570;&#x636E;&#x5E93;</h3>
<p>&#x6570;&#x636E;&#x5E93;&#x4F7F;&#x7528;&#x60C5;&#x51B5;&#x4E2D;&#xFF0C;&#x4E0D;&#x51FA;&#x610F;&#x5916;&#x5730;&#xFF0C;MySQL&#x4EE5;&#x8D85;&#x4E03;&#x6210;&#x7684;&#x5360;&#x6BD4;&#x9065;&#x9065;&#x9886;&#x5148;&#xFF0C;MongoDB &#x4E0E; PostgreSQL &#x8DDF;&#x968F;&#x5176;&#x540E;&#x3002;</p>
<p><img src="images/1-investigation-31.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;299</p>
<h3 id="66-&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;">6.6 &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;</h3>
<p>&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x4F7F;&#x7528;&#x4E2D;&#xFF0C;&#x524D;&#x4E09;&#x7684;&#x6392;&#x540D;&#x4F9D;&#x6B21;&#x4E3A;Windows&#x3001;Linux&#x3001;MaxOS&#xFF0C; &#x4E09;&#x5206;&#x5929;&#x4E0B;&#x3002; </p>
<p><img src="images/1-investigation-32.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;299</p>
<h3 id="67-linux&#x7248;&#x672C;">6.7 Linux&#x7248;&#x672C;</h3>
<p>&#x5728;Linux&#x7684;&#x53D1;&#x884C;&#x7248;&#x672C;&#x4E2D;&#xFF0C;&#x6700;&#x53D7;&#x6B22;&#x8FCE;&#x7684;&#x4F9D;&#x7136;&#x662F;Ubuntu&#xFF0C;&#x5360;&#x6BD4;&#x7EA6;&#x4E94;&#x6210;&#xFF0C;&#x7D27;&#x968F;&#x5176;&#x540E;&#x4E3A;Red Hat &#x548C;Debian&#x3002; </p>
<p><img src="images/1-investigation-33.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;239</p>
<h3 id="68-java-&#x6846;&#x67B6;">6.8 Java &#x6846;&#x67B6;</h3>
<p>&#x5728;Java&#x6846;&#x67B6;&#x4F7F;&#x7528;&#x65B9;&#x9762;&#xFF0C;Spring&#x5360;&#x6BD4;&#x8F83;&#x53BB;&#x5E74;&#x6709;&#x6240;&#x4E0B;&#x964D;&#xFF0C;&#x4F46;&#x4ECD;&#x5360;&#x6709;&#x7EDD;&#x5BF9;&#x4F18;&#x52BF;&#xFF0C;&#x5360;&#x636E;&#x7740;6&#x6210;&#x7684;&#x6BD4;&#x4F8B;&#x3002;</p>
<p><img src="images/1-investigation-34.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;240</p>
<h3 id="69-ruby-&#x6846;&#x67B6;">6.9 Ruby &#x6846;&#x67B6;</h3>
<p>&#x5728;Ruby&#x6846;&#x67B6;&#x4F7F;&#x7528;&#x65B9;&#x9762;&#xFF0C;Rails&#x7EE7;&#x7EED;&#x4FDD;&#x6301;&#x6392;&#x540D;&#x7B2C;&#x4E00;&#xFF0C;&#x6709;&#x8FD1;&#x4E09;&#x6210;&#x7684;&#x4F7F;&#x7528;&#x7387;&#xFF0C;&#x8F83;&#x53BB;&#x5E74;&#x6709;&#x6240;&#x4E0B;&#x964D;&#x3002;</p>
<p><img src="images/1-investigation-35.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;202</p>
<h3 id="610-php-&#x6846;&#x67B6;">6.10 PHP &#x6846;&#x67B6;</h3>
<p>PHP&#x8BED;&#x8A00;&#x7684;&#x6846;&#x67B6;&#x4F7F;&#x7528;&#x65B9;&#x9762;&#xFF0C;ThinkPHP&#x4F5C;&#x4E3A;&#x5168;&#x9762;&#x6210;&#x719F;&#x7684;&#x6846;&#x67B6;&#xFF0C;&#x6709;3&#x6210;&#x4EE5;&#x4E0A;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x5747;&#x4F7F;&#x7528;&#x8BE5;&#x6846;&#x67B6;&#x3002;</p>
<p><img src="images/1-investigation-36.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;202</p>
<h3 id="611-go-&#x6846;&#x67B6;">6.11 Go &#x6846;&#x67B6;</h3>
<p>Go&#x8BED;&#x8A00;&#x7684;&#x6846;&#x67B6;&#x5219;&#x5448;&#x73B0;&#x767E;&#x82B1;&#x9F50;&#x653E;&#x7684;&#x52BF;&#x6001;&#xFF0C;&#x4F7F;&#x7528;&#x8F83;&#x591A;&#x7684;Beego&#x6709;&#x8FD1;&#x56DB;&#x5206;&#x4E4B;&#x4E00;&#x7684;&#x7528;&#x6237;&#x6BD4;&#x4F8B;&#x3002;Beego&#x5728;&#x793E;&#x533A;&#x63A8;&#x5E7F;&#x7684;&#x6BD4;&#x8F83;&#x597D;&#xFF0C;&#x529F;&#x80FD;&#x6BD4;&#x8F83;&#x591A;&#x3002;</p>
<p><img src="images/1-investigation-37.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;205</p>
<h3 id="612-nodejs-&#x6846;&#x67B6;">6.12 Node.js &#x6846;&#x67B6;</h3>
<p>Node.js&#x6846;&#x67B6;&#x4E2D;&#xFF0C;Express&#x72EC;&#x9886;&#x98CE;&#x9A9A;&#xFF0C;&#x5360;&#x636E;&#x7740;&#x5C06;&#x8FD1;&#x4E94;&#x6210;&#x7684;&#x6BD4;&#x4F8B;&#x3002;</p>
<p><img src="images/1-investigation-38.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;204</p>
<h3 id="613-python-&#x6846;&#x67B6;">6.13 Python &#x6846;&#x67B6;</h3>
<p>Python&#x6846;&#x67B6;&#x4E2D;&#xFF0C;Django&#x8749;&#x8054;&#x699C;&#x9996;&#xFF0C;&#x8D85;&#x8FC7;&#x56DB;&#x6210;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x90FD;&#x5728;&#x4F7F;&#x7528;&#x3002; Flask&#x7D27;&#x8DDF;&#x5176;&#x540E;&#xFF0C;&#x5360;&#x6BD4;&#x8FBE;&#x5230;&#x4E09;&#x6210;&#x3002;</p>
<p><img src="images/1-investigation-39.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;221</p>
<h3 id="614-&#x524D;&#x7AEF;&#x6846;&#x67B6;">6.14 &#x524D;&#x7AEF;&#x6846;&#x67B6;</h3>
<p>&#x5728;&#x524D;&#x7AEF;&#x6846;&#x67B6;&#x4E2D;&#xFF0C;&#x8FD1;&#x516D;&#x6210;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x9009;&#x62E9;Vue.js&#xFF0C;&#x7D27;&#x968F;&#x5176;&#x540E;&#x7684;&#x662F;JQuery&#x548C;Bootstrap&#x3002; 
<img src="images/1-investigation-40.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;237</p>
<h3 id="615-cms-&#x7CFB;&#x7EDF;">6.15 CMS &#x7CFB;&#x7EDF;</h3>
<p>CMS&#x5EFA;&#x7AD9;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x7B80;&#x5355;&#x597D;&#x7528;&#x7684; WordPress &#x5360;&#x636E;&#x8D85;&#x8FC7;&#x56DB;&#x6210;&#x7684;&#x4EFD;&#x989D;&#xFF0C;&#x5177;&#x6709;&#x7EDD;&#x5BF9;&#x7684;&#x4F18;&#x52BF;&#x3002;Jekyll &#x548C;Cody&#x7D27;&#x968F;&#x5176;&#x540E;&#x3002; </p>
<p><img src="images/1-investigation-41.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;146</p>
<h3 id="616-&#x7535;&#x5B50;&#x5546;&#x52A1;&#x7CFB;&#x7EDF;">6.16 &#x7535;&#x5B50;&#x5546;&#x52A1;&#x7CFB;&#x7EDF;</h3>
<p>&#x7535;&#x5B50;&#x5546;&#x52A1;&#x5EFA;&#x7AD9;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;Magento&#x548C;Makingware&#x8FD8;&#x662F;&#x7ECF;&#x5E38;&#x88AB;&#x4F7F;&#x7528;&#x7684;&#x5F00;&#x6E90;&#x7535;&#x5546;&#x7CFB;&#x7EDF;&#x3002; </p>
<p><img src="images/1-investigation-42.png" alt="">
&#x6837;&#x672C;&#x6570;&#x91CF;&#xFF1A;146</p>
<h2 id="&#x4E03;&#x3001;&#x603B;&#x7ED3;--&#x81F4;&#x8C22;">&#x4E03;&#x3001;&#x603B;&#x7ED3; &amp; &#x81F4;&#x8C22;</h2>
<p>&#x672C;&#x6B21;2019&#x5E74;&#x5EA6;&#x4E2D;&#x56FD;&#x5F00;&#x6E90;&#x53C2;&#x4E0E;&#x8C03;&#x67E5;&#x62A5;&#x544A;&#x4EE5;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x534F;&#x4F5C;&#x7684;&#x65B9;&#x5F0F;&#x5171;&#x540C;&#x5B8C;&#x6210;&#xFF0C;&#x4EE5;&#x793E;&#x533A;&#x81EA;&#x53D1;&#x7EC4;&#x7EC7;&#xFF0C;&#x81EA;&#x5E95;&#x5411;&#x4E0A;&#x534F;&#x540C;&#x5B8C;&#x6210;&#x3002;&#x4E0E;&#x6574;&#x4E2A;&#x5E9E;&#x5927;&#x7684;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x6BD4;&#xFF0C;&#x6211;&#x4EEC;&#x4E2A;&#x4EBA;&#x7684;&#x89C6;&#x91CE;&#x548C;&#x8D44;&#x6E90;&#x90FD;&#x6709;&#x5C40;&#x9650;&#xFF0C;&#x8BE5;&#x62A5;&#x544A;&#x901A;&#x8FC7;&#x95EE;&#x5377;&#x65B9;&#x5F0F;&#x641C;&#x96C6;&#x6570;&#x636E;&#xFF0C;&#x5982;&#x7BA1;&#x4E2D;&#x7AA5;&#x8C79;&#xFF0C;&#x7565;&#x89C1;&#x4E00;&#x6591;&#x3002;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x7531;&#x6B64;&#x629B;&#x7816;&#x5F15;&#x7389;&#xFF0C;&#x9080;&#x8BF7;&#x66F4;&#x591A;&#x7684;&#x793E;&#x533A;&#x548C;&#x4E2A;&#x4EBA;&#x52A0;&#x5165;&#xFF0C;&#x4E00;&#x8D77;&#x6765;&#x5B8C;&#x5584;&#x4E2D;&#x56FD;&#x5F00;&#x6E90;&#x5E74;&#x5EA6;&#x62A5;&#x544A;&#x3002;&#x8BE5;&#x62A5;&#x544A;&#x7684;&#x95EE;&#x5377;&#x95EE;&#x9898;&#xFF0C; &#x62A5;&#x544A;&#x6587;&#x6863;&#x5747;&#x53D1;&#x5E03;&#x5728;&#x4EE3;&#x7801;&#x6258;&#x7BA1;&#x5E73;&#x53F0;&#xFF0C;&#x5F00;&#x6E90;&#x793E;&#x5B98;&#x65B9;&#x7F51;&#x7AD9;&#x548C;&#x5408;&#x4F5C;&#x4F19;&#x4F34;&#x7F51;&#x7AD9;&#x5E73;&#x53F0;&#xFF0C;&#x57FA;&#x4E8E; Creative Commons Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)  &#x8BB8;&#x53EF;&#x8BC1;&#x534F;&#x8BAE;&#x5206;&#x4EAB;&#x3002;&#x5BF9;&#x4E8E;&#x95EE;&#x5377;&#x7684;&#x95EE;&#x9898;&#x8BBE;&#x8BA1;&#x548C;&#x62A5;&#x544A;&#x5185;&#x5BB9;&#x6709;&#x4EFB;&#x4F55;&#x5EFA;&#x8BAE;&#x548C;&#x60F3;&#x6CD5;&#xFF0C;&#x6B22;&#x8FCE;&#x60A8;&#x5728;&#x4EE3;&#x7801;&#x6258;&#x7BA1;&#x5E73;&#x53F0;&#x4E0A;&#x63D0;&#x4EA4; Patch, &#x5BF9;&#x62A5;&#x544A;&#x8FDB;&#x884C;&#x8865;&#x5145;&#x548C;&#x8D21;&#x732E;&#x3002; &#x60A8;&#x7684;&#x4E00;&#x5C0F;&#x6B65;&#xFF0C; &#x6574;&#x4E2A;&#x4E2D;&#x56FD;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x7684;&#x4E00;&#x5927;&#x6B65;&#x3002; </p>
<p>&#x4E3A;&#x6B64;&#x95EE;&#x5377;&#x7BC7;&#x62A5;&#x544A;&#x4F5C;&#x51FA;&#x8D21;&#x732E;&#x7684;&#x5F00;&#x6E90;&#x793E;&#x5E74;&#x5EA6;&#x62A5;&#x544A;&#x5C0F;&#x7EC4;&#x6210;&#x5458;&#xFF1A;
&#x9648;&#x9633;&#xFF0C;&#x8D75;&#x751F;&#x5B87;&#xFF0C;&#x5434;&#x7ECD;&#x5CAD;</p>
<p>&#x793E;&#x533A;&#x5408;&#x4F5C;&#x4F19;&#x4F34;&#xFF1A; 
CSDN&#xFF0C;&#x5F00;&#x6E90;&#x4E2D;&#x56FD;&#xFF0C;Linux&#x4E2D;&#x56FD;
&#x6700;&#x540E;&#x611F;&#x8C22;&#x7279;&#x9080;&#x7684;&#x5F00;&#x6E90;&#x9886;&#x57DF;&#x7684;&#x4E13;&#x5BB6;&#xFF0C;&#x66F4;&#x8981;&#x7279;&#x522B;&#x611F;&#x8C22;&#x79EF;&#x6781;&#x53C2;&#x4E0E;&#x6211;&#x4EEC;&#x8C03;&#x7814;&#x7684;&#x6BCF;&#x4E00;&#x4F4D;&#x670B;&#x53CB;&#x3002; </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="perface.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 前言">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"问卷篇","level":"1.3","depth":1,"next":{"title":"数据篇","level":"1.4","depth":1,"ref":"","articles":[{"title":"Grank 分析","level":"1.4.1","depth":2,"path":"data-grank.md","ref":"data-grank.md","articles":[]},{"title":"Gitee 分析","level":"1.4.2","depth":2,"path":"data-gitee.md","ref":"data-gitee.md","articles":[]}]},"previous":{"title":"前言","level":"1.2","depth":1,"path":"perface.md","ref":"perface.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"开源社","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"2019 中国开源年度报告","gitbook":"*","description":"2019 中国开源年度报告"},"file":{"path":"investigation.md","mtime":"2020-01-01T14:18:53.300Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-01-01T15:05:24.204Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

